{
  "AdminAsyncStatusHelp": "Este comando mostrará el estado de todas las operaciones en curso.",
  "AdminAsyncStatusIndexHelp": "Obtener el estado de la operación asincrónica en un índice específico.",
  "AdminBackupEnvironmentParamHelp": "Dirección URL o identificador del entorno del que hay que hacer copia de seguridad.",
  "AdminCopyEnvironmentHelp": "Copiar entorno de origen a entorno de destino",
  "AdminCopyEnvironmentNameHelp": "Nombre del entorno de destino",
  "AdminCopyEnvironmentSourceIdHelp": "Identificador del entorno de origen que se está copiando",
  "AdminCopyEnvironmentSourceUrlHelp": "URL del entorno de origen que se está copiando",
  "AdminCopyEnvironmentTargetIdHelp": "Identificador del entorno de destino",
  "AdminCopyEnvironmentTargetUrlHelp": "URL del entorno de destino",
  "AdminCopySourceEnvironmentHelp": "Dirección URL del entorno o identificador del entorno de origen que se está copiando",
  "AdminCopyTargetEnvironmentHelp": "Dirección URL del entorno o identificador del entorno de destino",
  "AdminCopyingEnvironment": "Copiando entorno...",
  "AdminDeleteEnvironmentError": "No se pudo realizar la operación de eliminación de entorno",
  "AdminDeleteEnvironmentHelp": "Elimina el entorno de su inquilino",
  "AdminDeleteEnvironmentIdHelp": "Identificador del entorno que se va a eliminar",
  "AdminDeleteEnvironmentInfo": "Eliminando {0} de su inquilino...",
  "AdminDeleteEnvironmentParamHelp": "Dirección URL o id. del entorno que debe eliminarse de su inquilino.",
  "AdminDeleteEnvironmentResponse": "El entorno {0} se eliminó correctamente de su inquilino",
  "AdminDeleteEnvironmentUrlHelp": "Dirección URL del entorno que debe eliminarse de su inquilino",
  "AdminEnvironmentCurrencyHelp": "Establece la divisa usada para su entorno. [el valor predeterminado es USD]",
  "AdminEnvironmentDomainHelp": "El nombre de dominio forma parte de la dirección URL del entorno. Si el nombre de dominio ya se está usando, se le anexará un valor numérico. Ejemplo: si \"contoso\" ya se está usando, la dirección URL del entorno se actualizará a https://{contoso}0.crm.dynamics.com.",
  "AdminEnvironmentDomainRegexHelp": "Solo se permiten caracteres comprendidos entre [A-Z], [a-z], [0-9] o \"-\". El primer y el último carácter no pueden ser \"-\". No se permiten caracteres \"-\" consecutivos.",
  "AdminEnvironmentIdNotFound": "El entorno con la URL \"{0}\" no está presente en su inquilino.",
  "AdminEnvironmentIdWithBackups": "Id. del entorno que tiene copias de seguridad.",
  "AdminEnvironmentLanguageHelp": "Establece el idioma usado para su entorno. [el valor predeterminado es inglés]",
  "AdminEnvironmentLocationHelp": "Establece el nombre de región del entorno. [el valor predeterminado es Estados Unidos]",
  "AdminEnvironmentMatchingFilterCriteriaNotFound": "No se encontraron entornos en su inquilino que cumplan los criterios de filtro especificados.",
  "AdminEnvironmentNameHelp": "Establece el nombre del entorno.",
  "AdminEnvironmentNotFound": "No se encontraron entornos en su inquilino.",
  "AdminEnvironmentPurposeHelp": "Establece la descripción que se usa para asociar el entorno a una intención específica.",
  "AdminEnvironmentRestore": "La operación de restauración del entorno se completó con el estado: \"{0}\"",
  "AdminEnvironmentTeamIdHelp": "Id. de equipo como GUID",
  "AdminEnvironmentTeamIdInvalid": "El id. de equipo no es un GUID válido.",
  "AdminEnvironmentTemplateHelp": "Establece la aplicación de Dynamics 365 que se debe implementar. [se pasa como valores separados por comas] por ejemplo: -tm \"D365_Sample, D365_Sales\"",
  "AdminEnvironmentTypeHelp": "Establece el tipo de entorno.",
  "AdminEnvironmentUrlWithBackups": "URL del entorno que tiene copias de seguridad.",
  "AdminEnvironmentWithIdNotFound": "El entorno con el id. {0} no está presente en su inquilino.",
  "AdminEnvironmentWithUrlNotFound": "El entorno con la URL {0} no está presente en su inquilino.",
  "AdminHelp": "Trabajar con su cuenta de administrador de PowerPlatform",
  "AdminListBackupsEnvironmentParamHelp": "Mostrar todos los entornos que contienen una cadena determinada en su identificador o URL de entorno.",
  "AdminListEnvironmentBackupsHelp": "Muestra todas las copias de seguridad de su entorno.",
  "AdminListEnvironmentHelp": "Mostrar todos los entornos de su inquilino",
  "AdminListEnvironmentIdHelp": "Mostrar todos los entornos que contienen una cadena determinada en su id.",
  "AdminListEnvironmentNameHelp": "Mostrar todos los entornos que contienen una cadena determinada en su nombre.",
  "AdminListEnvironmentParamHelp": "Mostrar todos los entornos que contienen una cadena determinada en su nombre o identificador.",
  "AdminListEnvironmentTypeHelp": "Mostrar todos los entornos del tipo especificado.",
  "AdminListEnvironmentUrlHelp": "Mostrar todos los entornos que contienen una cadena determinada en su URL.",
  "AdminListOrganizationIdHelp": "Mostrar todos los entornos que contienen una cadena determinada en su id. de organización.",
  "AdminListingEnvironment": "Mostrando todos los entornos de su inquilino...",
  "AdminPollingCompleted": "Sondeo completado con el código de estado: {0}",
  "AdminPollingRequest": "Sondeando para comprobar el estado del entorno... Tiempo de ejecución: {0}",
  "AdminResetEnvironmentHelp": "Restablecer entorno de su inquilino",
  "AdminResetEnvironmentIdHelp": "Identificador del entorno que se va a restablecer",
  "AdminResetEnvironmentParamHelp": "Dirección URL o identificador del entorno que hay que restablecer.",
  "AdminResetEnvironmentUrlHelp": "URL del entorno que se va a restablecer",
  "AdminResettingEnvironment": "Restableciendo entorno...",
  "AdminRestoreSourceEnvironmentHelp": "Dirección URL del entorno o identificador del entorno de origen necesario para la restauración.",
  "AdminRestoreTargetEnvironmentHelp": "Dirección URL del entorno o identificador del entorno de destino necesario para la restauración. Si no se proporciona, se usará de forma predeterminada la URL o el identificador de origen.",
  "AliasWithColon": "(alias: {0})",
  "ApplicationHelp": "Comandos para enumerar e instalar aplicaciones de Dataverse disponibles desde AppSource",
  "ApplicationInstallEnvironmentHelp": "Entorno de destino donde se instalará la aplicación",
  "ApplicationInstallHelp": "Instala la aplicación de Dataverse en un entorno determinado",
  "ApplicationInstallNameHelp": "Nombre único de la aplicación que se instalará en el entorno de destino",
  "ApplicationInstallSuccess": "Aplicación instalada correctamente",
  "ApplicationJsonListHelp": "Ubicación del archivo JSON que contiene la lista de las aplicaciones de Dataverse que se instalarán desde AppSource",
  "ApplicationJsonOutputHelp": "Ubicación del archivo JSON que se creará con la lista de las aplicaciones de Dataverse de AppSource",
  "ApplicationListEnvironmentHelp": "Enumera las aplicaciones de Dataverse disponibles para un entorno determinado; si no se especifica, enumera todas las aplicaciones del inquilino (valor predeterminado: lista para todos los entornos)",
  "ApplicationListHelp": "Enumera las aplicaciones de Dataverse disponibles en AppSource",
  "ApplicationPolling": "Sondeando para comprobar el estado de la aplicación... Tiempo de ejecución: {0}",
  "ArgsFileInputArgumentHelp": "Argumentos de verbo que se pasarán en un archivo de entrada .json. Ejemplo: {\"name\" : \"contoso\"}. Los argumentos pasados mediante la línea de comandos tendrán prioridad sobre los argumentos del archivo de entrada .json.",
  "AsyncOperationArgumentHelp": "Argumento booleano opcional para ejecutar verbos pac de forma asincrónica; el valor predeterminado es false.",
  "AsyncOperationsStatusInfo": "Se desencadenó la operación asincrónicamente. Utilice \"pac admin status\" para comprobar el estado de las operaciones asincrónicas.",
  "AsyncProcessPollingMessage": "Procesando la solicitud asincrónica... tiempo de ejecución: {0} y {1} % completado",
  "AsyncProcessSuccessfullyCompleted": "Trabajo asincrónico finalizado después de {0} y 100 % completado",
  "AuthClearComplete": "Se han quitado los perfiles de autenticación y la caché de tokens",
  "AuthClearHelp": "Borra todos los perfiles de autenticación almacenados en este equipo",
  "AuthCreateApplicationIdHelp": "Opcional: identificador de aplicación con el que se va a autenticar",
  "AuthCreateApplicationIdValidationHelp": "El identificador de aplicación no puede ser una cadena vacía.",
  "AuthCreateAuthenticationFlowValidationHelp": "Debe elegir un nombre de usuario/contraseña, una credencial de cliente o un código de dispositivo como flujo de autenticación.",
  "AuthCreateClientSecretHelp": "Opcional: secreto de cliente con el que se va a autenticar",
  "AuthCreateClientSecretValidationHelp": "El secreto de cliente no puede ser una cadena vacía.",
  "AuthCreateClientTenantHelp": "Id. de inquilino si se usa el id. y el secreto de aplicación.",
  "AuthCreateClientTenantRequiredHelp": "Se requiere un id. de inquilino al crear un perfil de autenticación de id. y secreto de aplicación",
  "AuthCreateClientTenantValidationHelp": "El valor de id. de inquilino no es un GUID válido",
  "AuthCreateCloudInstanceHelp": "Opcional: instancia en la nube con la que se va a autenticar",
  "AuthCreateDeviceCodeSwitchHelp": "Utilice el flujo DeviceCode de AAD para el inicio de sesión interactivo.",
  "AuthCreateHelp": "Crea y almacena perfiles de autenticación en este equipo",
  "AuthCreateKindHelp": "Tipo de perfil de autenticación que va a crear; el valor predeterminado es Dataverse",
  "AuthCreateKindValidationHelp": "El valor '{0}' pasado para {1} no es válido. Tipos válidos: {2}.",
  "AuthCreatePasswordHelp": "Opcional: la contraseña para autenticar con",
  "AuthCreatePasswordValidationHelp": "La contraseña no puede ser una cadena vacía.",
  "AuthCreateResourceHelp": "Dirección URL del recurso a la que se va a conectar",
  "AuthCreateResourceValidationHelp": "El valor '{0}' pasado para {1} no es una dirección URL o un GUID válido.",
  "AuthCreateSuccess": "Autenticación creada correctamente.",
  "AuthCreateUsernameHelp": "Opcional: nombre de usuario con el que se autenticará; muestra el cuadro de diálogo de AAD si no se especifica",
  "AuthCreateUsernameValidationHelp": "El nombre de usuario no puede ser una cadena vacía; el formato típico es: 'user@contoso.onmicrosoft.com'",
  "AuthDeleteHeader": "Perfil eliminado:",
  "AuthDeleteHelp": "Elimina un perfil de autenticación determinado",
  "AuthDeleteIndexHelp": "Índice del perfil que se va a eliminar",
  "AuthHelp": "Administre cómo se autentica en diferentes servicios",
  "AuthListHeader": "Perfiles (* indica que está activo):",
  "AuthListHelp": "Enumera los perfiles de autenticación almacenados en este equipo",
  "AuthListNoProfiles": "No se encontraron perfiles en este equipo. Ejecute '{0}' para crear uno.",
  "AuthNameHeader": "Se ha asignado nombre al siguiente perfil:",
  "AuthNameHelp": "Asignar nombre o cambiar el nombre de un perfil de autenticación existente",
  "AuthNameIndexHelp": "Índice del perfil al que se va a asignar nombre o cuyo nombre se va a cambiar",
  "AuthNameInvalidLength": "El nombre debe tener entre 1 y 12 caracteres",
  "AuthNameNameHelp": "Nombre que desea asignar a este perfil de autenticación (máximo de 12 caracteres)",
  "AuthNameProfileFailure": "Los perfiles actuales del equipo tienen duplicados. Ejecute {0} y vuelva a crear perfiles nuevos.",
  "AuthNoAuthority": "No se puede obtener la dirección de autoridad para la URL {0}",
  "AuthProfileExpired": "(expiró hace {0} minutos)",
  "AuthProfileExpiresIn": "(expira en {0} minutos)",
  "AuthProfileInvalid": "El perfil actual tiene información incompleta. Puede que se haya creado con una versión anterior de la CLI. Ejecute '{0}' y vuelva a crear un perfil nuevo.",
  "AuthProfileNameAlreadyExist": "El nombre proporcionado ya existe.",
  "AuthProfileNameDoesNotExist": "No hay ningún perfil de autenticación con el nombre \"{0}\"",
  "AuthProfileNoneOfKind": "No se encontraron perfiles de tipo {0} en este equipo. Ejecute '{1}' para crear uno.",
  "AuthProfileOfServicePrincipalLacksResourcePermission": "Su ServicePrincipal carece de permisos para el recurso \"{0}\". Cambie a otro perfil o conceda el permiso a la aplicación y vuelva a crear el perfil.",
  "AuthProfileUseExpired": "Está intentando usar un perfil de autenticación que ha expirado. Cambie a otro perfil o elimine el perfil y vuelva a crearlo.",
  "AuthSelectHeader": "Nuevo perfil predeterminado:",
  "AuthSelectHelp": "Seleccione el perfil de autenticación que debe estar activo",
  "AuthSelectIndexHelp": "Índice del perfil que se va a activar",
  "AuthSelectIndexNotValid": "El valor {0} de {1} no es válido. Debe estar entre 1 y {2}.",
  "AuthSelectNameHelp": "Nombre del perfil que se va a activar",
  "AuthSelectNoIndexOrNameProvided": "No se proporcionó ningún índice o nombre",
  "AuthValidatingConnection": "Validando conexión...",
  "BackingUpEnvironment": "Realizando copia de seguridad del entorno con la etiqueta: {0}",
  "BackupEnvironmentHelp": "Realiza una copia de seguridad manual de su entorno.",
  "BackupEnvironmentIdHelp": "Identificador del entorno del que hay que hacer copia de seguridad.",
  "BackupEnvironmentUrlHelp": "Dirección URL del entorno del que hay que hacer copia de seguridad.",
  "BackupLabelHelp": "Establece la etiqueta de copia de seguridad proporcionada.",
  "BackupNotesHelp": "Notas adicionales para esta copia de seguridad.",
  "BiConditionalArguments": "Ambos campos del par {0} son obligatorios.",
  "BuildVersionUpdateStrategyHelp": "Actualiza la versión build del archivo \"Solution.xml\" mediante la estrategia especificada. Si se usa gittags, establezca personal access token en la siguiente variable de entorno \"PacCli.PAT\"",
  "CannotProcessCommand": "Se usó '{0}', pero el comando anterior no sabe cómo procesarlo.",
  "CanvasModuleHelp": "Se utilizan archivos .msapp de Power Apps",
  "CanvasPackHelp": "Empaquetar los orígenes en un archivo msapp",
  "CanvasPackMsAppHelp": "Ruta de acceso al archivo .msapp",
  "CanvasPackSourcesHelp": "Directorio de los orígenes que se va a empaquetar",
  "CanvasUnpackHelp": "Extraer los orígenes de un archivo msapp",
  "CanvasUnpackSourcesHelp": "Directorio de los orígenes que se va a desempaquetar",
  "CdsAuthKindCannotResolveAuthority": "No se puede resolver la autoridad de AAD/OAuth para {0}",
  "CdsAuthKindValidationUrlNotSpecified": "Para crear un perfil, se debe especificar una dirección URL de Dataverse mediante el argumento --url",
  "CdsAuthKindValidationUrlNotValid": "La dirección URL \"{0}\" no es una URL válida de Dataverse. Las direcciones URL deben usar el protocolo seguro HTTPS.",
  "CliCompleteHelp": "Muestra la lista de palabras de Autocompletar",
  "CliCompleteSentenceHelp": "Oración parcial que se va a completar",
  "CliHelpHelp": "Mostrar ayuda sobre Microsoft PowerPlatform CLI",
  "CliTelemetryDisableHelp": "No enviar información de uso para ayudar a Microsoft a mejorar este producto",
  "CliTelemetryDisabled": "Recopilación de telemetría deshabilitada.",
  "CliTelemetryEnableHelp": "Enviar información de uso para ayudar a Microsoft a mejorar este producto",
  "CliTelemetryEnabled": "Recopilación de telemetría habilitada.",
  "CliTelemetryHelp": "Administrar configuración de telemetría",
  "CliTelemetryStatusDisabled": "Telemetría está deshabilitada actualmente",
  "CliTelemetryStatusEnabled": "Telemetría está habilitada actualmente",
  "CliTelemetryStatusHelp": "Muestra el estado actual de la telemetría",
  "CommandDoesNotTakeArguments": "Este comando no admite argumentos.",
  "CommandDoesNotTakeSubCommands": "Este comando no admite subcomandos.",
  "CommandNotUnderstood": "El comando '{0}' no se entiende en este contexto.",
  "CommandsWithColon": "Comandos: ",
  "ConnectedTo": "Conectado a...",
  "ConnectionEnvironmentIdHelp": "Id. del entorno que tiene conexiones.",
  "ConnectionHelp": "Comandos para trabajar con la conexión de Dataverse.",
  "ConnectionListHelp": "Lista de todas las conexiones del entorno que se ha pasado.",
  "ConnectionNotFound": "No se encontraron conexiones en el entorno pasado.",
  "CorruptAuthToken": "No se puede leer el token de autenticación. Ejecute 'pac auth create' para generar un nuevo token.",
  "CorruptedFeatureFlagsFile": "El archivo de marcas de característica {0} está dañado.",
  "CouldNotFindDirectoryForJsonInputFile": "No se pudo encontrar el directorio especificado para el archivo de entrada .json proporcionado.",
  "CouldNotFindJsonInputFile": "No se pudo encontrar el archivo de entrada .json proporcionado.",
  "CreateEnvironmentHelp": "Crea un entorno de Dataverse en su inquilino.",
  "CreateEnvironmentInfo": "Creando el entorno {0} de Dataverse en su inquilino.",
  "CreateEnvironmentWithNameWarning": "No se puede especificar el nombre del entorno de Teams. Se omitirá el argumento {0}",
  "CreateSettingsExtractionRoot": "Extrayendo referencias de conexión de Dataverse y/o variables de entorno de: {0}",
  "CreateSettingsSettingsFileCreated": "Archivo de configuración de implementación creado: {0}",
  "CreateSettingsSolutionFolderHelp": "Ruta de acceso a la carpeta de solución local desempaquetada: la raíz del archivo \"Other/Solution.xml\" o una carpeta con un archivo .cdsproj.",
  "CreateSettingsSolutionZipHelp": "Ruta de acceso al archivo zip de la solución.",
  "DeprecatedArgumentError": "El argumento {0} está en desuso y ya no se admite.",
  "DeprecatedArgumentHelpTextFormat": "(en desuso) {0}",
  "DeprecatedArgumentIgnored": "El argumento {0} está en desuso y se omitirá.",
  "DeprecatedArgumentReplaced": "El argumento {0} quedará en desuso pronto. Utilice {1} en su lugar.",
  "DirectoryNameIsInvalid": "El nombre del directorio no es válido",
  "DotnetCommandError_ExitCode": "Error imprevisto al ejecutar internamente un comando CLI de dotnet (código de salida: {0}).",
  "DotnetConfigurationError_ExitCode": "Se ha producido un error de configuración de CLI de dotnet (código de salida: {0}). Compruebe que el archivo global.json está configurado correctamente y que tiene instalado el SDK y el tiempo de ejecución necesarios. La ejecución de \"dotnet --version\" debería funcionar sin errores.",
  "DotnetNotFound_MinV": "No se encontró la CLI de dotnet. Asegúrese de que ha instalado la CLI de dotnet (https://dotnet.microsoft.com/download/dotnet) y de que está disponible a través de la variable de entorno PATH. Versión mínima admitida: {0}.",
  "DotnetSdkVersionNotSupported_Version_MinV": "El .NET SDK configurado actualmente (versión {0}) no se admite para este verbo. Versión mínima admitida: {1}. Puede configurar la versión del .NET SDK mediante un archivo global.json aplicable en el directorio de trabajo actual.",
  "DotnetSdkVersionNotSupported_Version_MinV_MaxV": "El .NET SDK configurado actualmente (versión {0}) no se admite para este verbo. Versión mínima admitida: {1}. Versión máxima (exclusiva): {2}. Puede configurar la versión del .NET SDK mediante un archivo global.json aplicable en el directorio de trabajo actual.",
  "EnvironmentBackupsNotFound": "No se encontraron copias de seguridad del entorno especificado.",
  "EnvironmentIdIsInvalid": "El identificador de entorno especificado no es válido.",
  "EnvironmentOverrideArgumentHelp": "Id. del entorno de destino. El valor predeterminado es el entorno de su perfil de autenticación de Dataverse actualmente activo.",
  "EnvironmentOverrideParamHelp": "Id. o URL del entorno de destino. El valor predeterminado es el entorno de su perfil de autenticación de Dataverse activo actualmente.",
  "EnvironmentParsingError": "Error al analizar los datos. Falta la propiedad \"{0}\".",
  "EnvironmentRuntimeStateChanged": "Se ha cambiado el estado del entorno de ejecución de su entorno con el código de estado: {0}",
  "ErrorHandlingFile": "Se produjo IOException al controlar el archivo: {0}",
  "ErrorReadingJsonInputFile": "JSON no válido en el archivo .json proporcionado.",
  "ErrorRunningTool": "Error al ejecutar la herramienta: {0} con argumentos: {1}.",
  "ErrorWithColon": "Error: ",
  "FileAt": "  Archivo en {0}.",
  "FileNotFound": "Archivo no encontrado: {0}",
  "HelpWithColon": "Ayuda: ",
  "HintsWithColon": "Sugerencias: ",
  "InitFailure": "Error al crear el proyecto {0}. El directorio actual ya contiene un proyecto. Cree un nuevo directorio y vuelva a intentar la operación.",
  "IntegersOnlyRegexHelp": "El valor debe ser un entero positivo",
  "InvalidAppTemplate": "Plantillas de aplicación \"{0}\" no válidas. Seleccione los valores de una plantilla válida entre los siguientes: \"{1}\".",
  "InvalidArgumentFormat": "El argumento {0} no es válido. Se esperaba el tipo {1} y se obtuvo: {2}",
  "InvalidArgumentInputDirectoryNotFound_Path": "No se encontró el directorio \"{0}\".",
  "InvalidArgumentInputFileExtensionNotAllowed_FileName_AllowedExtensions": "El archivo \"{0}\" tiene una extensión de archivo no válida. Extensiones de archivo permitidas: {1}",
  "InvalidArgumentInputFileNotFound_Path": "No se encontró el archivo \"{0}\".",
  "InvalidArgumentSolutionFileInvalidFormat_FilePath": "El archivo \"{0}\" no es un archivo de solución válido.",
  "InvalidArgumentValue": "El valor del argumento {0} es incorrecto: {1}.",
  "InvalidArgumentValueLength": "El argumento {0} tiene una longitud incorrecta. La longitud del argumento debe estar entre {1} y {2}.",
  "InvalidCurrencyCode": "Código de divisa \"{0}\" no válido. Seleccione un código de divisa válido entre los siguientes: \"{1}\".",
  "InvalidEnvironmentParamValue": "Valor no válido para el parámetro de entorno \"{0}\". Pase una dirección URL o un GUID válido. Por ejemplo, \"https://contoso.crm.dynamics.com\" O un GUID de 36 caracteres (con guiones).",
  "InvalidFrameworkValue": "El valor de marco \"{0}\" no se admite a partir de ahora.",
  "InvalidLanguageName": "Idioma \"{0}\" no válido. Seleccione un idioma válido entre los siguientes: \"{1}\".",
  "InvalidProjectDirectoryName": "Nombre de proyecto {0} vacío o no válido",
  "InvalidProjectFileExtension_ProjectFileName_ValidExtensions": "Archivo de proyecto no válido {0}. Extensiones de archivo permitidas: {1}.",
  "InvalidSwitchArgumentValue": "El valor pasado a {0} no es válido. Si no se pasa ningún valor, el argumento se establecerá en true de forma predeterminada. Valores: true, false.",
  "InvalidUriArgumentValue": "El valor pasado a {0} no es válido.",
  "ListingEnvironmentBackups": "Mostrando todas las copias de seguridad de su entorno con la dirección URL: {0}",
  "LogFileNameIsInvalid": "El nombre del archivo de registro no es válido: {0}",
  "MaxAsyncWaitTimeHelp": "Tiempo de espera asincrónico máximo en minutos. El valor predeterminado es 60 minutos",
  "MissingFeatureFlagsFile": "Falta el archivo de marcas de característica {0}.",
  "MissingRequiredArgValue": "El argumento \"{0}\" debe tener un valor especificado.",
  "MissingRequiredArgument": "Falta un argumento {0} necesario.",
  "MissingRequiredTool": "Falta una herramienta necesaria: {0}. Agregue {0} a la variable de entorno Path o use 'Developer Command Prompt for VS'.",
  "MissingSubCommand": "Falta un subcomando.",
  "MultipleFilesFoundMatchingSearchPattern_Folder_Pattern": "Se encontraron varios archivos en el directorio \"{0}\" que coinciden con el patrón de búsqueda \"{1}\".",
  "MultipleProjectsFound": "Se encontraron varios archivos de proyecto con la extensión {0} en el directorio {1}.",
  "MultipleSolutionRootsFound": "Se encontraron varias carpetas raíz de solución en el directorio \"{0}\" (buscando un archivo .cdsproj u \"Other/solution.xml\" para inferir). Especifique la raíz de la solución en la que desea centrarse. Se encontró: {1}",
  "MutuallyExclusiveArguments_2": "Debe especificar {0} o {1}, pero no ambos.",
  "MutuallyExclusiveArguments_3": "Debe especificar {0}, {1} o {2}.",
  "MutuallyExclusiveOrNeitherArguments_2": "Solo debe proporcionar uno de los argumentos {0} o {1}, o ninguno de ellos.",
  "MutuallyExclusiveOrNeitherArguments_3": "Solo debe proporcionar uno de los argumentos {0}, {1} o {2}, o ninguno de ellos.",
  "NewProjectFolderPathNotEmpty": "No se puede crear el proyecto porque la carpeta no está vacía.",
  "NewVersionFound": "NOTA: Se ha encontrado una nueva versión. Ejecute \"pac tool {0} --install\" para instalar la versión más reciente.",
  "NoResultsReturned": "No se han devuelto resultados.",
  "NoVersionAttribute": "Falta un atributo de versión en {0}.",
  "NoWasItMisspelled": "No, ¿estaba mal escrito?",
  "NoWrapInQuotes": "No, asegúrese de delimitar los valores que contienen espacios.",
  "NoneInParenthesis": "(Ninguno)",
  "NotAGitRepo": "El proyecto no es un repositorio git válido",
  "NotValidCommand": "No es un comando válido. Intente ejecutar '{0} [command] help'.",
  "OptionsWithColon": "Opciones: ",
  "OrgConnectionFailed": "No se pudo establecer conexión con la organización de Dataverse en {0}.",
  "OrgEntityEntityNameHelp": "Nombre de la entidad",
  "OrgEntityGetFieldsHeader": "Campos de {0} ({1}):",
  "OrgEntityGetFieldsHelp": "Muestra los campos de una entidad",
  "OrgEntityGetFieldsLine": "{0} ({1})",
  "OrgEntityGetRecordsFieldNotValid": "No se pudo encontrar el campo '{0}' en '{1}'. Puede ejecutar '{2} {3} {4} {5}' para ver una lista de campos.",
  "OrgEntityGetRecordsFieldsHelp": "Lista de los campos de esta entidad que se van a obtener (use * para obtener todos)",
  "OrgEntityGetRecordsHeader": "Nº de registro{0}",
  "OrgEntityGetRecordsHelp": "Muestra un registro específico de una entidad",
  "OrgEntityGetRecordsIdHelp": "Identificador del registro que se va a obtener",
  "OrgEntityGetRecordsIdNotValid": "El identificador pasado no es un GUID válido.",
  "OrgEntityHelp": "Obtiene información sobre una entidad en Dataverse",
  "OrgEnvironmentId": "Id. de entorno:",
  "OrgFriendlyName": "Nombre descriptivo:",
  "OrgHelp": "Trabaje con su organización de Dataverse",
  "OrgId": "Id. de organización:",
  "OrgListHelp": "Enumera todas las organizaciones de Dataverse a las que el usuario tiene acceso",
  "OrgListRequiresUserProfile": "Para enumerar las organizaciones se requiere un perfil de autenticación de usuario, no de aplicación",
  "OrgQueryHelp": "Muestra los resultados de una consulta en Dataverse",
  "OrgQueryRowHeader": "Nº de fila{0}",
  "OrgQuerySqlHelp": "Consulta SQL SELECT que se va a ejecutar",
  "OrgResultRow": "{0}: {1}",
  "OrgUniqueName": "Nombre único:",
  "OrgUrl": "URL de organización:",
  "OrgUserId": "Id. de usuario:",
  "OrgWhoHelp": "Muestra información sobre la organización actual de Dataverse",
  "OrganizationInformation": "Información de la organización",
  "PAPortalBundleHelp": "Agrupar contenido del sitio web del portal en formato XML compatible con CMT",
  "PAPortalDownloadHelp": "Descargar contenido del sitio web del portal de la organización actual de Dataverse",
  "PAPortalDownloadSucceeded": "La descarga del portal se realizó correctamente en {0} segundos",
  "PAPortalHelp": "Comandos para trabajar con el sitio web del portal de PowerApps",
  "PAPortalListHelp": "Enumerar todos los sitios web del portal de la organización actual de Dataverse",
  "PAPortalReguidHelp": "Asigna un nuevo GUID al atributo de clave principal para todos los registros de un sitio web",
  "PAPortalUploadHelp": "Cargar contenido del sitio web del portal en la organización actual de Dataverse",
  "PAPortalUploadSucceeded": "La carga del portal se realizó correctamente",
  "PCFPatchVersionUpdateStartegyHelp": "Actualiza la versión de patch de los archivos \"ControlManifest.xml\" mediante la estrategia especificada. Si se usa gittags, establezca personal access token en la siguiente variable de entorno \"PacCli.PAT\"",
  "PackSolutionProcessEnd": "Solución empaquetada.",
  "PackSolutionProcessStart": "Empaquetando solución...",
  "PackageAddExternalPackage": "Agrega un paquete externo a un proyecto de paquete de PD",
  "PackageAddExternalPackageArgumentPackageType": "Tipo del paquete que se va a agregar. Por ejemplo, \"xpp\" para los paquetes FnO.",
  "PackageAddExternalPackageArgumentPath": "Ruta de acceso al paquete externo",
  "PackageAddItemToProjectSuccess": "El elemento se agregó correctamente.",
  "PackageAddProjectItemArgumentImportOrder": "Un número entero que indica el orden donde se insertará este elemento en el archivo ImportConfig.xml final en el momento de la compilación. Los números negativos se insertan delante de los elementos existentes. Los números positivos se agregan detrás de los elementos existentes.",
  "PackageAddProjectItemArgumentSkipValidation": "Agrega el elemento al archivo de proyecto aunque el archivo no exista o parezca no ser válido. Tenga en cuenta que esto no afectará a ninguna tarea de validación que realice MSBuild.",
  "PackageAddReference": "Agrega referencia al proyecto de solución de Dataverse",
  "PackageAddReferencePathSwitch": "Ruta de acceso al proyecto de solución de Dataverse al que se hace referencia",
  "PackageAddReferenceSuccess": "Referencia al proyecto de Dataverse agregada correctamente al paquete.",
  "PackageAddSolution": "Agrega un archivo de solución de Dataverse precompilado a un proyecto de paquete de PD",
  "PackageAddSolutionArgumentPath": "Ruta de acceso al archivo de la solución de Dataverse (debe ser *.zip)",
  "PackageArgumentHelp": "ruta de acceso a un archivo DLL de paquete o un archivo zip con un paquete",
  "PackageDeployHelp": "Implementa el paquete en un entorno de Dataverse",
  "PackageDeployedSuccessfully": "El paquete se implementó correctamente",
  "PackageHelp": "Comandos para trabajar con proyectos de paquete de Dataverse",
  "PackageInitArgumentIncludePkgAssetsContent": "Indica si se deben incluir también algunos archivos de ejemplo para la carpeta PkgAssets/Content.",
  "PackageInitArgumentPackageName": "Establece el nombre predeterminado del paquete. Se aplica a la generación de ImportExtension.GetNameOfImport.",
  "PackageInitArgumentTemplate": "Nombre de la plantilla de la que se va a crear una instancia. Nota: La plantilla \"legacy\" se eliminará en una versión futura.",
  "PackageInitHelp": "Inicializa un directorio con un nuevo proyecto de paquete de Dataverse",
  "PackageInitSuccess": "El proyecto de paquete se creó correctamente en \"{0}\".",
  "PackageInvalidFileName": "\"{0}\": el nombre del archivo dll o zip del paquete no es válido",
  "PackageProjectFileNotSupported_ProjectFileName": "El proyecto \"{0}\" no es compatible con este verbo. Asegúrese de que el proyecto se creó con la última llamada a \"pac package init\".",
  "PackageShowDescription": "Descripción: {0}",
  "PackageShowError": "No se pudo analizar el paquete: {0}",
  "PackageShowHelp": "Muestra detalles del paquete de Dataverse",
  "PackageShowLocation": "Ubicación: {0}",
  "PackageShowLongName": "Nombre largo: {0}",
  "PackageShowName": "Nombre: {0}",
  "PackageShowSolutionDisplayName": "Nombre para mostrar de la solución: {0}",
  "PackageShowSolutionVersion": "Versión de la solución: {0}",
  "PackageShowSolutions": "El paquete contiene {0} soluciones",
  "ParseExceptionCurrentCommand": "Comando actual:",
  "ParseExceptionFailedOn": "Error de análisis en:",
  "ParseExceptionKnownArgument": "¿Es un argumento conocido?",
  "ParseExceptionKnownCommand": "¿Es un comando conocido?",
  "ParseExceptionQuoteWrapped": "¿Se incluyó entre comillas?",
  "PatchVersionTrackerFileExtensionError": "La extensión de nombre de archivo para la estrategia de seguimiento de archivos solo puede ser CSV",
  "PatchVersionTrackerFileName": "Nombre del archivo CSV de seguimiento que se usará cuando se utilice filetracking como estrategia. El valor predeterminado es ControlsStateVersionInfo.csv",
  "PathIsNotValid": "La ruta de acceso {0} no es válida.",
  "PcfCommitIDError": "No se puede recuperar el identificador de confirmación más reciente para el control: {0}",
  "PcfControlFolderNameParseError": "No se puede analizar el nombre de la carpeta raíz del control: {0}",
  "PcfControlManifestNotFound": "No se encontró el archivo ControlManifest.Input.xml en {0}.",
  "PcfControlManifestPathHelp": "Ruta de acceso absoluta o relativa del archivo \"ControlManifest.xml\" para la actualización.",
  "PcfControlManifestTooManyFound": "Se encontraron varios archivos ControlManifest.Input.xml en {0}.",
  "PcfControlNoChangeInResource": "No se detectaron cambios en '{0}'.",
  "PcfControlUpdatingResource": "Actualizando '{0}'.",
  "PcfControlVersionFileInvalidContent": "Se ha encontrado contenido no válido en {0}",
  "PcfDiscoverAllManifestFilesHelp": "Actualiza la versión de patch de todos los archivos \"ControlManifest.xml\"",
  "PcfHashControlVersionNotMatching": "La versión del control hash de {0} no tiene el formato admitido para el análisis",
  "PcfHelp": "Comandos para trabajar con proyectos de PowerApps component framework",
  "PcfIncludesReservedWord": "El valor '{0}' pasado al argumento es o incluye una palabra reservada.",
  "PcfInitFailedNpmCommand": "No se pudo ejecutar el comando \"{0}\". Ejecute \"{0}\" en este directorio para instalar las dependencias del proyecto.",
  "PcfInitHelp": "Inicializa un directorio con un nuevo proyecto de PowerApps component framework",
  "PcfInitNameHelp": "Nombre del componente",
  "PcfInitNameRegexHelp": "Solo se permiten caracteres comprendidos entre [A-Z], [a-z] o [0-9]. El primer carácter no puede ser un número.",
  "PcfInitNamespaceHelp": "Espacio de nombres del componente",
  "PcfInitNamespaceRegexHelp": "Solo se permiten caracteres comprendidos entre [A-Z], [a-z], [0-9] o '.'. El primer y el último carácter no pueden ser '.'. No se permiten caracteres '.' consecutivos. No se permiten números como primer carácter o inmediatamente después de un punto.",
  "PcfInitPackageJsonUpdateError": "Error al actualizar la versión de las bibliotecas de plataforma en \"package.json\". Actualice manualmente las versiones react y fluent en el archivo \"package.json\".",
  "PcfInitPlatformLibrariesVersionError": "Error al cargar la versión de las bibliotecas de plataforma. Actualice manualmente las versiones react y fluent.",
  "PcfInitRunNpmInstall": "Asegúrese de ejecutar 'npm install' o un equivalente en este directorio para instalar las dependencias del proyecto.",
  "PcfInitRunNpmRefreshTypes": "Ejecute 'npm run refreshTypes' después de 'npm install' en este directorio para generar el archivo ManifestDesignTypes.d.ts.",
  "PcfInitRunningNpmCommand": "Ejecutando \"{0}\" por usted...",
  "PcfInitSuccessfullyCreatedProject": "El proyecto de PowerApps component framework se creó correctamente en \"{0}\".",
  "PcfInitTemplateHelp": "Elija una plantilla para el componente",
  "PcfInvalidGitPAT": "Falta el token de acceso personal o no es válido para insertar etiquetas en el origen remoto en la variable de entorno {0}",
  "PcfMaximumLengthExceeded": "La longitud total de los valores de los argumentos '{0}' y '{1}' no puede ser superior a {2}.",
  "PcfNoManifestFilesFound": "No se encontraron archivos de {0} en ninguna de las carpetas de {1}.",
  "PcfPatchVersionFileNameMisMatchError": "Existe un archivo de seguimiento con el nombre: {0}",
  "PcfPatchVersionHelp": "Versión de revisión de los controles",
  "PcfPatchVersionMultipleTrackerFilesError": "Hay varios archivos csv en el directorio de trabajo de nivel superior",
  "PcfPatchVersionUpdateDirectoryHelp": "Especificar el manifiesto de destino que se debe actualizar",
  "PcfProjectNotFound": "El archivo de proyecto de PowerApps component framework con la extensión pcfproj no se encontró en el directorio {0}.",
  "PcfProjectTooManyFound": "Se encontraron varios archivos pcfproj en {0}.",
  "PcfPushBuildExeNotFound": "No se pudo encontrar dotnet.exe o msbuild.exe para compilar la solución temporal.",
  "PcfPushBuildingTempSolution": "Compilando el contenedor de solución temporal.",
  "PcfPushCheckingResources": "Comprobando si hay cambios en cada recurso.",
  "PcfPushComparingControlManifests": "Comparando el manifiesto de la organización actual con el manifiesto de {0}.",
  "PcfPushControlManifestsDifferent": "Los archivos \"ControlManifest.xml\" son diferentes.",
  "PcfPushControlManifestsEqual": "Los archivos \"ControlManifest.xml\" son iguales.",
  "PcfPushControlNotFound": "El control no se encontró en la organización actual.",
  "PcfPushDoesControlExistOnOrg": "Comprobando si el control '{0}' ya existe en la organización actual.",
  "PcfPushDone": "Actualizando el control en la organización actual: listo.",
  "PcfPushForceImportHelp": "Forzar una actualización completa del control",
  "PcfPushHelp": "Importar el proyecto de PowerApps component framework a la organización actual de Dataverse",
  "PcfPushLoadingControlFromOrg": "El control existe en la organización actual; se están cargando los detalles del control.",
  "PcfPushLocatingResources": "Buscando los recursos web usados por el control '{0}'.",
  "PcfPushOnlySupportsUnmanaged": "El control existe en la organización actual, pero está administrado. El comando '{0}' solo funciona en los controles no administrados.",
  "PcfPushTempSolutionBuildFailed": "Compilación del contenedor de solución temporal: error. Consulte {0} para obtener más detalles.",
  "PcfPushTempSolutionBuildSucceeded": "Compilación del contenedor de solución temporal: listo.",
  "PcfPushTempSolutionCreated": "Creación del contenedor de solución temporal: listo.",
  "PcfPushTempSolutionCreating": "Creando un contenedor de solución temporal para insertar el componente.",
  "PcfPushTempSolutionCreationFailed": "Creación del contenedor de solución temporal: error. Consulte los registros para obtener más detalles.",
  "PcfPushTempSolutionDoneImport": "Importación del contenedor de solución temporal a la organización actual: listo.",
  "PcfPushTempSolutionStartImport": "Importando el contenedor de solución temporal a la organización actual.",
  "PcfPushTempSolutionZipDropped": "Eliminación del archivo zip del contenedor de solución temporal: listo.",
  "PcfPushUnknownError": "Error al comprobar la organización actual: {0}. Recurriendo a la actualización completa.",
  "PcfPushUsingFullUpdate": "Usando actualización completa.",
  "PcfPushUsingIncrementalUpdate": "Usando actualización incremental.",
  "PcfPushVerbosityHelp": "Nivel de detalle de MSBuild al compilar el contenedor de solución temporal.",
  "PcfTagRegExNotMatching": "El nombre de etiqueta no tiene el formato correcto para el control con los detalles siguientes. ControlName: {0}, CommitID: {1}, Versión: {2}",
  "PcfTrackerFileInvalidPath": "Ruta de acceso no válida para el archivo de seguimiento: {0}",
  "PcfVersionDone": "Versión de patch de los archivos \"ControlManifest.xml\" especificados finalizada.",
  "PluginHelp": "Comandos para trabajar con la biblioteca de clases del complemento Dataverse",
  "PluginInitAuthorHelp": "Autores del paquete de complementos de Dataverse.",
  "PluginInitHelp": "Inicializa un directorio con una nueva biblioteca de clases del complemento Dataverse.",
  "PluginInitSigningKeyFilePathHelp": "Ruta relativa al archivo de claves del originador del ensamblado del complemento Dataverse para la firma.",
  "PluginInitSigningKeyFilePathValidationHelp": "No es una extensión de archivo de claves válida: {0}. Proporcione un archivo .snk o .pfx válido para el ensamblado del complemento Dataverse.",
  "PluginInitSuccess": "La biblioteca de clases del complemento Dataverse denominada \"{0}\" se creó correctamente en el directorio actual.",
  "PortalActionCompleted": "Descargado: {0} [{1}]",
  "PortalAppsHelp": "Comandos para mostrar aplicaciones y recuentos de descargas al usuario actual",
  "PortalAppsResult": "Lista de todas las aplicaciones de {0}",
  "PortalBundleConvertedForEntity": "Se procesaron {0} registros para la tabla: {1}",
  "PortalBundleSavedSeparateXml": "Se procesaron {0} registros para la tabla: {1} y se guardaron en {2}",
  "PortalBundleSavedSingleXml": "Xml de datos guardados en {0}",
  "PortalCDSClientRetryMaxReached": "Se alcanzó el número máximo de reintentos para obtener el cliente de Dataverse. Vuelva a intentarlo",
  "PortalDataManifestFailure": "No se pudieron realizar las operaciones de manifiesto para la tabla {0}; omitiendo el registro",
  "PortalDataManifestLoad": "Cargando manifiesto del portal...",
  "PortalDataManifestLoadComplete": "Manifiesto cargado correctamente.",
  "PortalDataManifestUpdate": "Actualizando manifiesto...",
  "PortalDataManifestUpdateComplete": "Manifiesto actualizado correctamente.",
  "PortalDataParsingComplete": "Análisis de datos de tabla del portal completado",
  "PortalDeploymentConfigError": "No se pudo aplicar la configuración de implementación para la tabla: {0}, columna: {1} ",
  "PortalDeploymentConfigParseError": "No se pudo analizar la configuración de implementación del portal; elimine la configuración o revierta a la última configuración válida conocida",
  "PortalDeploymentProfileNotFound": "No se encontró el archivo del perfil de implementación {0}.",
  "PortalDeploymentProfileParseError": "No se pudo analizar el perfil de implementación; asegúrese de que el perfil de implementación tenga el formato correcto.",
  "PortalDirectoryNotFound": "Directorio {0} no encontrado",
  "PortalDirectoryOperationFailed": "No se pudo realizar la operación de directorio: {0}",
  "PortalDirectoryParseFailure": "No se pudieron procesar los campos de la tabla {0}; omitiendo el registro",
  "PortalDownloadExcludeEntitiesHelp": "Lista separada por comas de nombres lógicos de entidades para excluir la descarga",
  "PortalDownloadFailedForAField": "NO SE PUDO procesar el campo {0} de la tabla {1} con el id. de registro {2} debido a {3}",
  "PortalDownloadFileAlreadyExist": "El archivo {0} ya existe. Proporcione un argumento -o true para sobrescribir el contenido",
  "PortalDownloadIncludeEntitiesHelp": "Descargar solo las entidades especificadas para este argumento en el nombre lógico de entidad separado por comas",
  "PortalDownloadIncludeExcludeOverlap": "No se admiten los argumentos (--includeEntities y --excludeEntities) en una sola solicitud de descarga",
  "PortalDownloadInvalidJsonEditorType": "El tipo {0} no se puede descargar",
  "PortalDownloadLocaleFormat": "Formato de archivo de configuración regional [Json o Yaml]",
  "PortalEntityDownloadStart": "Descargando: {0} [{1}]...",
  "PortalEntityNotFound": "Las entidades del portal no están disponibles en esta organización; instale el paquete del portal en la organización.",
  "PortalEntitySchemaError": "No se puede encontrar la definición de entidad de {0} en el archivo de esquema",
  "PortalEntityUploadComplete": "Carga completada para la tabla: {0}",
  "PortalEntityUploadNoChanges": "0 entidades cargadas. No se han detectado cambios desde la última descarga de datos del portal.",
  "PortalEntityUploadTimeout": "Tiempo de espera de la respuesta de carga para la tabla: {0} carga continua",
  "PortalFileReadFailure": "No se pudo leer el archivo {0} debido a {1}",
  "PortalFileSaveFailure": "No se pudo cargar el archivo {0} debido a {1}",
  "PortalFolderCreateailure": "No se pudo crear la carpeta {0} debido a {1}",
  "PortalHelp": "Comandos para trabajar con el servicio en línea PowerApps Studio",
  "PortalInvalidJsonAttributeWarning": "ADVERTENCIA: Se esperaba un valor json para el campo {0} de la tabla {1} Id.: {2}",
  "PortalInvalidUploadPath": "La ruta de carga proporcionada no contiene datos del portal; especifique la ruta del directorio que contiene website.yml",
  "PortalListCompleted": "Se completó el listado de sitios web del portal",
  "PortalLocaleExtractFailure": "No se pudo extraer texto localizado para el idioma {0} y la clave {1}",
  "PortalLocaleFolderNotAvailable": "La carpeta {0} no existe en {1}",
  "PortalManifestKeyError": "No se pudo analizar el manifiesto del portal; falta la clave {0} del objeto {1}",
  "PortalManifestParseError": "No se pudo analizar el manifiesto del portal; elimine el manifiesto o revierta a la última configuración válida conocida",
  "PortalNoRecordsForEntity": "No existe ningún registro en la tabla {0}",
  "PortalPublisherResult": "Lista de editores de {0}",
  "PortalPubsVerb": "Comandos para mostrar editores para el usuario actual",
  "PortalSkipExportOnlyEntity": "Omitiendo la tabla Exportar solamente: {0}",
  "PortalUploadInvalidJsonEditorType": "El tipo {0} no se puede cargar",
  "PortalUploadMultipleEntityDataFilesDetected": "Se detectaron archivos de datos de varias tablas",
  "PortalUploadRecordFailure": "NO SE PUDO actualizar la tabla {0} con el id. de registro {1} debido a {2}",
  "PortalWebsiteBundleExcludePKHelp": "Si esta marca es verdadera, los campos de clave principal no se incluyen en el xml de datos para que CMT genere nuevos id. de registro al importar.",
  "PortalWebsiteBundleOutputHelp": "Ruta de acceso en la que se guardarán los archivos XML",
  "PortalWebsiteBundlePathHelp": "Ruta de acceso desde la que se agrupará el contenido del sitio web",
  "PortalWebsiteBundleSplitXmlHelp": "Si esta marca es verdadera, se creará un archivo xml diferente para cada entidad",
  "PortalWebsiteContentOverwrite": "Contenido del sitio web del portal que se sobrescribirá",
  "PortalWebsiteDownloadPathHelp": "Ruta de acceso en la que se descargará el contenido del sitio web",
  "PortalWebsiteDownloadProcessStart": "Se inició la descarga del sitio web {0}",
  "PortalWebsiteExportTranslations": "Exportar contenido de la traducción en la carpeta de configuración regional: el valor \"All\" extrae todo el contenido para los clientes de C1 y C2. El valor \"SupportedLang\" extrae el contenido localizable para los clientes de C2",
  "PortalWebsiteIdToDownload": "Id. del sitio web del portal que se va a descargar",
  "PortalWebsiteMergeLocaleHelp": "Vuelve a combinar el contenido localizado con los archivos yaml del portal",
  "PortalWebsiteNotAvailable": "El registro de sitio web {0} no existe.",
  "PortalWebsitePathHelp": "Ruta donde se encuentran los archivos del sitio web",
  "PortalWebsiteUploadDeploymentProfileHelp": "Nombre del perfil de implementación que se usará. El valor predeterminado es \"predeterminado\"",
  "PortalWebsiteUploadPathHelp": "Ruta de acceso desde la que se cargará el contenido del sitio web",
  "PortalWebsiteUploadProcessStart": "Se inició la carga de datos del sitio web",
  "PortalWebsitesNotExists": "No existe ningún registro de sitio web",
  "PortalXRMNetworkError": "Error de red XRM: {0}",
  "ProjectReferenceAlreadyExists_RelPath": "El proyecto ya tiene una referencia a \"{0}\".",
  "ProjectRootSearchNoAccess": "No se puede buscar la raíz del proyecto desde: {0}, acceso denegado para: {1}",
  "ReactControlsDoesNotSupportTheming": "Los controles React no admiten la creación de temas de PCF por el momento. Creando un control React sin tema.",
  "ReferenceNoProjectsFound": "No se encontró ningún tipo de proyecto admitido en la ruta de acceso {0}.",
  "ReferenceTooManyProjectsFound": "Se encontró más de un tipo de proyecto admitido en la ruta de acceso {0}.",
  "RequiredProjectFileMissing_ExpectedPath": "No se encontró el archivo de proyecto necesario \"{0}\".",
  "RestoreEnvironmentHelp": "Restaura un entorno a una copia de seguridad determinada.",
  "RestoreEnvironmentStart": "Restaurando entorno desde el origen \"{0}\" al destino \"{1}\". Se esperará un máximo de 60 para que se complete antes de dar como errónea la operación",
  "RestoreSelectBackupHelp": "Fecha y hora de la copia de seguridad con el formato \"dd/mm/aaaa hh:mm\" O la cadena \"más reciente\".",
  "RestoreSourceIdHelp": "Identificador del entorno de origen necesario para la restauración.",
  "RestoreSourceUrlHelp": "Dirección URL del entorno de origen necesaria para la restauración.",
  "RestoreTargetIdHelp": "Identificador del entorno de destino necesario para la restauración. Si no se proporciona, se usará de forma predeterminada el identificador de origen.",
  "RestoreTargetNameHelp": "Nombre opcional del entorno restaurado.",
  "RestoreTargetUrlHelp": "URL del entorno de destino necesario para la restauración. Si no se proporciona, se usará de forma predeterminada la URL de origen.",
  "RestoredEnvironment": "La restauración del entorno se completó con el código de estado: {0}",
  "SelectBackupDateIsInvalid": "La fecha especificada tiene un formato incorrecto. Use el formato \"dd/mm/aaaa hh: mm\".",
  "SolutionAddReferenceFailure": "No se puede agregar una referencia a un proyecto que tiene el mismo nombre que el proyecto de Dataverse denominado {0}.",
  "SolutionAddReferenceHelp": "Agrega una referencia del proyecto del directorio actual al proyecto de 'path'.",
  "SolutionAddReferencePathHelp": "Ruta de acceso al proyecto al que se hace referencia",
  "SolutionAddReferenceSuccess": "Referencia del proyecto agregada correctamente al proyecto de solución de Dataverse.",
  "SolutionBuildRevisionVersionHelp": "Actualizar la versión build o revision de la solución",
  "SolutionBuildVersionHelp": "Versión build de la solución",
  "SolutionCheckCustomPAEndpointHelp": "Especifique una URL personalizada como punto de conexión del Comprobador de Power Apps",
  "SolutionCheckFilesExcludeHelp": "Excluir archivos del análisis. Se pasan como valores separados por comas",
  "SolutionCheckGeoHelp": "Instancia geográfica del servicio Comprobador de PowerApps que se debe usar.",
  "SolutionCheckHelp": "Cargar un proyecto de solución de Dataverse para ejecutarlo en el servicio Comprobador de PowerApps",
  "SolutionCheckPathHelp": "Ruta donde se encuentra el archivo zip de la solución que se va a comprobar",
  "SolutionCheckRuleOverrideFileNotFound": "No se encontró el archivo de invalidación de regla.",
  "SolutionCheckRuleOverrideFormatInvalid": "El contenido del archivo de invalidación de regla no tiene el formato correcto. Los valores aceptados para OverrideLevel son: Critical, High, Medium, Low, Informational. Ejemplo: [{\"Id\":\"meta-remove-dup-reg\",\"OverrideLevel\":\"Medium\"},{\"Id\":\"il-avoid-specialized-update-ops\",\"OverrideLevel\":\"Medium\"}]",
  "SolutionCheckRuleOverrideHelp": "Ruta de acceso a un archivo que contiene reglas y niveles de matriz JSON para invalidar. Los valores aceptados para OverrideLevel son: Critical, High, Medium, Low, Informational. Ejemplo: [{\"Id\":\"meta-remove-dup-reg\",\"OverrideLevel\":\"Medium\"},{\"Id\":\"il-avoid-specialized-update-ops\",\"OverrideLevel\":\"Medium\"}]",
  "SolutionCheckRuleSetError": "El parámetro especificaba un nombre de conjunto de reglas desconocido: \"{0}\" (obtuvo conjuntos de reglas de: {1})",
  "SolutionCheckRuleSetHelp": "Seleccione un conjunto de reglas que se ejecutará como parte de esta compilación. Valores: un Guid válido, \"AppSource Certification\", \"Solution Checker\" (valor predeterminado)",
  "SolutionCheckUrlHelp": "URI de SAS que apunta al archivo solution.zip que se va a analizar",
  "SolutionCloneErrorFolderExists": "La carpeta de soluciones ya existe y no está vacía.",
  "SolutionCloneExtractSucceeded": "La extracción de la solución se realizó correctamente.",
  "SolutionCloneHelp": "Crea un proyecto de solución basado en una solución existente en su organización",
  "SolutionCloneManagedExportSucceeded": "La exportación de la solución administrada se realizó correctamente.",
  "SolutionCloneUnmanagedExportSucceeded": "La exportación de la solución no administrada se realizó correctamente.",
  "SolutionCreateSettingsHelp": "Cree un archivo de configuración desde la carpeta de soluciones o el archivo zip de la solución.",
  "SolutionDeleteHelp": "Eliminar la solución Dataverse del entorno actual de Dataverse",
  "SolutionDeleteProcessEnd": "La solución se eliminó correctamente.",
  "SolutionDeleteProcessStart": "Eliminando solución de Dataverse...",
  "SolutionExportAsyncHelp": "Exporta la solución asincrónicamente",
  "SolutionExportAsyncProcessEnd": "Trabajo asincrónico completado. Id. de exportación: {0}",
  "SolutionExportAsyncProcessStart": "Esperando hasta que el trabajo asincrónico se complete... Id. de exportación: {0}",
  "SolutionExportErrorFileExists": "El archivo de salida {0} de la solución ya existe.",
  "SolutionExportErrorInvalidPath": "{0} es una ruta de archivo no válida. {1}",
  "SolutionExportHelp": "Exportar una solución Dataverse del entorno actual de Dataverse",
  "SolutionExportIncludeHelp": "Configuración que debe incluirse en la solución que se va a exportar",
  "SolutionExportManagedHelp": "Si la solución debe exportarse como una solución administrada",
  "SolutionExportNameHelp": "Nombre de la solución que se va a exportar",
  "SolutionExportPathHelp": "Ruta donde se escribirá el archivo zip de la solución exportada",
  "SolutionExportProcessStart": "Iniciando exportación de la solución...",
  "SolutionExportSucceeded": "La exportación de la solución se realizó correctamente.",
  "SolutionExportTargetVersionHelp": "Versión que admitirá la solución exportada",
  "SolutionHelp": "Comandos para trabajar con proyectos de solución de Dataverse",
  "SolutionImportActivatePluginsHelp": "Activa complementos y flujos de trabajo en la solución",
  "SolutionImportAsHoldingHelp": "Importa la solución como solución de retención",
  "SolutionImportAsyncHelp": "Importa la solución asincrónicamente",
  "SolutionImportAsyncProcessEnd": "Trabajo asincrónico completado.",
  "SolutionImportAsyncProcessStart": "Esperando hasta que el trabajo asincrónico se complete... Id. de trabajo: {0}",
  "SolutionImportConvertToManagedHelp": "Convertir como solución administrada",
  "SolutionImportFailed": "No se pudo importar la solución.",
  "SolutionImportHelp": "Importar la solución de Dataverse en el entorno actual de Dataverse",
  "SolutionImportImplicitProjectNotFound": "Debe proporcionar la ruta de acceso al archivo zip de la solución como el argumento {0} o ejecutar el comando {1} desde dentro del directorio del proyecto de solución de Dataverse.",
  "SolutionImportOverwriteUnmanagedHelp": "Fuerza la sobrescritura de las personalizaciones no administradas",
  "SolutionImportPathHelp": "Ruta al archivo zip de la solución. Si no se especifica, se supone que la carpeta actual es un proyecto cdsproj.",
  "SolutionImportProcessEnd": "La solución se ha importado correctamente. Id. de importación: {0}",
  "SolutionImportProcessStart": "Importando solución...",
  "SolutionImportPublishHelp": "Publica los cambios tras una importación correcta",
  "SolutionImportSettingsHelp": "El archivo .json con la configuración de implementación para las referencias de conexión y las variables de entorno.",
  "SolutionImportSkipDependencyHelp": "Omite la comprobación de dependencias respecto a las dependencias marcadas como actualización del producto",
  "SolutionInitAssetSuccessLine1": "Los archivos de solución de Dataverse se crearon correctamente para este proyecto en el subdirectorio {0}, con el nombre de solución {1}, el nombre del editor {2} y el prefijo de personalización {3}.",
  "SolutionInitAssetSuccessLine2": "Compruebe la información del editor y el nombre de la solución del archivo {0}.",
  "SolutionInitCustomizationPrefixHelp": "Valor del prefijo de personalización del editor de soluciones de Dataverse",
  "SolutionInitCustomizationPrefixRegexHelp": "El prefijo debe tener entre 2 y 8 caracteres, solo puede contener caracteres alfanuméricos, debe empezar con una letra y no puede comenzar por 'mscrm'.",
  "SolutionInitExistingProject": "Ya existen archivos de solución de Dataverse en el directorio actual. Omitiendo la creación de archivos de solución de Dataverse.",
  "SolutionInitHelp": "Inicializa un directorio con un nuevo proyecto de solución de Dataverse",
  "SolutionInitPublisherNameHelp": "Nombre del editor de soluciones de Dataverse",
  "SolutionInitPublisherNameRegexHelp": "Solo se permiten caracteres comprendidos entre [A - Z], [a - z] y [0 - 9] o ser _. El primer carácter solo puede estar entre [A - Z] y [a - z] o ser _.",
  "SolutionInitSuccess": "El proyecto de solución de Dataverse denominado \"{0}\" se creó correctamente en \"{1}\"",
  "SolutionInitTooManyOtherDirectories": "Se encontró un directorio de solución de Dataverse adicional, {0}. Conserve solo un directorio.",
  "SolutionInitTooManySolutionXmlFiles": "Se encontraron varios archivos {0} en {1}.",
  "SolutionLicenseAddHelp": "Agregar información de licencia y plan a la solución",
  "SolutionLicenseFileNotFound": "No se encuentra el archivo de licencia \"{0}\"",
  "SolutionLicenseMismatchedCsvFile": "El archivo .csv del plan de servicio \"{0}\" tiene un número inesperado de columnas; vea la ayuda de \"pac solution add-license\". Se encontró esta línea de encabezado CSV: \"{1}\"",
  "SolutionLicenseMismatchedSoPa": "Esta pac CLI y el SolutionPackager incluido no coinciden. Póngase en contacto con el soporte técnico.",
  "SolutionLicensePlanApplied": "El plan de licencia se ha aplicado a los 2 archivos de origen en: {0}",
  "SolutionLicensePlanDefinitionFileHelp": "Archivo de definición del plan de licencia en formato CSV; las columnas esperadas son: Id. de servicio, Nombre para mostrar, Dirección URL de información suplementaria",
  "SolutionLicensePlanMappingFileHelp": "Archivo de asignación del plan de licencia en formato CSV; las columnas esperadas son: Id. de servicio, Nombre del componente",
  "SolutionListHelp": "Enumerar todas las soluciones de la organización actual de Dataverse",
  "SolutionListNotFound": "No se encontró la solución \"{0}\" en la organización de destino de Dataverse",
  "SolutionListingAll": "Enumerando todas las soluciones de la organización actual de Dataverse...",
  "SolutionNameHelp": "Nombre de la solución",
  "SolutionNoNameFound": "No se encuentra el nombre de la solución en el archivo \"{0}\"",
  "SolutionPackHelp": "Empaquetar componentes de la solución del sistema de archivos local en solution.zip (SolutionPackager)",
  "SolutionPackUnpackAllowDeletes": "Indica si pueden realizarse operaciones de eliminación [Yes|No]; valor predeterminado: No.",
  "SolutionPackUnpackAllowWrites": "Indica si pueden realizarse operaciones de escritura; valor predeterminado: false.",
  "SolutionPackUnpackArgumentError": "{0}",
  "SolutionPackUnpackClobber": "Permite la eliminación o la sobrescritura de los archivos marcados como de solo lectura; valor predeterminado: false.",
  "SolutionPackUnpackDisablePluginRemap": "Reasignación del nombre de tipo completo del complemento deshabilitada. Valor predeterminado: false",
  "SolutionPackUnpackErrorLevel": "Nivel de registro mínimo para la salida del registro [Verbose|Info|Warning|Error|Off]; valor predeterminado: Info",
  "SolutionPackUnpackFolder": "Ruta de acceso a la carpeta raíz del sistema de archivos local. Al desempaquetar o extraer componentes se escribirá en esta ruta, mientras que al empaquetarlos se leerá de ella.",
  "SolutionPackUnpackHelp": "Extraer componentes de la solución de solution.zip en el sistema de archivos local (SolutionPackager)",
  "SolutionPackUnpackLocaleTemplate": "Genera un archivo de recursos de plantilla. Solo es válido para Extraer. Los valores posibles son automático o un código LCID/ISO del idioma que desea exportar. Si es Presente, se extraerán los recursos de cadena de la configuración regional especificada como un archivo .resx neutro. Si se especifica automático o simplemente el formato largo o corto del modificador, se utilizará la configuración regional base de la solución.",
  "SolutionPackUnpackLocalize": "Extraiga o combine todos los recursos de cadena en archivos .resx.",
  "SolutionPackUnpackLogFile": "Ruta de acceso al archivo de registro.",
  "SolutionPackUnpackMappingFile": "Ruta de acceso completa a un archivo xml de asignación desde el que se leerán las carpetas de componentes que se van a empaquetar.",
  "SolutionPackUnpackPackageType": "Al desempaquetar o extraer, se utiliza para especificar la operación dual Managed y Unmanaged. Al empaquetar, se utiliza para especificar Managed o Unmanaged de un desempaquetado anterior \"Both\". Puede ser: \"Unmanaged\", \"Managed\" o \"Both\"; valor predeterminado: \"Unmanaged\".",
  "SolutionPackUnpackSingleComponent": "Realice la acción en un único tipo de componente [WebResource|Plugin|Workflow|None]; valor predeterminado: None.",
  "SolutionPackUnpackUseLcid": "Utilice LCID (1033) en lugar de códigos ISO (en-US) para los archivos de idioma.",
  "SolutionPackUnpackUseUnmanagedFileForManaged": "Utilice el mismo archivo de código fuente XML cuando se encuentre un empaquetado Managed y solo un archivo XML Unmanaged; se aplica a los archivos AppModuleSiteMap, AppModuleMap y FormXml",
  "SolutionPackUnpackZipFile": "Ruta de acceso completa al archivo ZIP de la solución",
  "SolutionPatchVersionHelp": "Versión de Patch de la solución",
  "SolutionProjectNotFound": "El archivo de proyecto de la solución de Dataverse con la extensión cdsproj no se encontró en el directorio.",
  "SolutionProjectOutputZipNotFound": "No se encontró ningún archivo *.zip para el proyecto de solución de Dataverse. ¿Ha olvidado compilar?\\nRuta del proyecto: {0}",
  "SolutionProjectRootNotFound": "No se encontró la raíz del proyecto de solución (buscando un archivo .cdsproj u \"Other/solution.xml\" para inferir). Especifique la raíz del proyecto.",
  "SolutionPublishHelp": "Publica todas las personalizaciones",
  "SolutionPublishedAllCustomizations": "Publicadas todas las personalizaciones.",
  "SolutionPublishingAllCustomizations": "Publicando todas las personalizaciones...",
  "SolutionRevisionVersionHelp": "Versión revision de la solución",
  "SolutionSetOnlineVersionHelp": "Establece la versión de la solución cargada en el entorno de Dataverse.",
  "SolutionUpgradeAsyncHelp": "Actualiza la solución asincrónicamente",
  "SolutionUpgradeAsyncProcessEnd": "Trabajo de actualización asincrónica de la solución completado, Id. de solicitud: ",
  "SolutionUpgradeAsyncProcessStart": "Esperando hasta que el trabajo de actualización asincrónica de la solución se complete... Id. de solicitud: ",
  "SolutionUpgradeHelp": "Opción para realizar una copia intermedia de la solución de Dataverse para la actualización",
  "SolutionUpgradeProcessEnd": "La solución se actualizó correctamente. Id. de solicitud: ",
  "SolutionUpgradeProcessStart": "Actualizando la solución...",
  "SolutionVersionHelp": "Especifique el número de versión de la solución.",
  "SolutionVersionInvalidProjFile": "No se puede encontrar el archivo cdsproj o un archivo \"Solution.xml\" en el directorio actual \"{0}\".",
  "ToolCMTHelp": "Iniciar Configuration Migration Tool",
  "ToolHelp": "Power Platform tools que se pueden instalar e iniciar",
  "ToolInstallHelp": "Instalar la versión más reciente.",
  "ToolInstallationComplete": "Instalación finalizada",
  "ToolInstalling": "Instalando la versión {0} de {1}....",
  "ToolPDHelp": "Iniciar Package Deployer",
  "ToolPRTHelp": "Iniciar Plugin Registration Tool",
  "UnhandledExceptionLogFileLocation_Path": "Los registros de diagnóstico se encuentran en: {0}",
  "UnhandledExceptionMessage": "Lo sentimos, la aplicación detectó un error no recuperable y debe finalizar. Se han capturado los detalles de la excepción, que se reenviarán al equipo de desarrollo si se ha habilitado la telemetría. Id. de excepción:",
  "UnhandledExceptionMessage_ExId_ExType": "Lo sentimos, la aplicación detectó un error no recuperable y debe finalizar. Se han capturado los detalles de la excepción, que se reenviarán al equipo de desarrollo si se ha habilitado la telemetría. Id. de excepción: {0}, Tipo de excepción: {1}",
  "UnknownArgument": "Se pasó un argumento desconocido {0}.",
  "UnknownArgumentValue": "Se pasó un valor argumento desconocido para {0}.",
  "UnknownCommand": "Comando desconocido '{0}' enviado.",
  "UnneededArgument": "Se pasó un argumento innecesario.",
  "UnpackProcessEnd": "Solución desempaquetada.",
  "UnpackProcessStart": "Desempaquetando solución...",
  "UpdatedBuildVersionFilePath": "Versión build actualizada para {0}.",
  "UpdatedPatchVersionFilePath": "Versión de Patch actualizada para {0}.",
  "UpdatedRevisionVersionFilePath": "Versión revision actualizada para {0}.",
  "UsageWithColon": "Uso: {0}",
  "ValuesWithColon": "Valores: ",
  "VerbArgumentExceptionErrorMessage_ArgName_Reason": "El argumento \"{0}\" no es válido. {1}",
  "VerbArgumentFramework": "Marco de representación del control.",
  "VerbArgumentLogToConsole": "Registro de salida a la consola",
  "VerbArgumentLogToFile": "Ruta de acceso del archivo de registro",
  "VerbArgumentOutputDirectory": "Directorio de salida",
  "VerbArgumentRunNpmInstall": "Ejecute automáticamente 'npm install' después de crear el control. El valor predeterminado es 'true'",
  "VersionAlreadyInstalled": "Ya está instalada la versión más reciente.",
  "VersionIsInvalid": "No se puede determinar la versión de \"{0}\".",
  "VersionNotInstalled": "Necesita ejecutar \"pac tool {0} --install\" para obtener el último archivo ejecutable.",
  "VersionWithColon": "Versión: {0}",
  "WarningWithColon": "Advertencia: ",
  "Yes": "Sí"
}