{
  "AdminAsyncStatusHelp": "Lệnh này sẽ liệt kê trạng thái của tất cả các hoạt động đang diễn ra.",
  "AdminAsyncStatusIndexHelp": "Nhận trạng thái của hoạt động không đồng thời tại chỉ mục cụ thể.",
  "AdminBackupEnvironmentParamHelp": "URL hoặc ID môi trường của môi trường cần phải sao lưu.",
  "AdminCopyEnvironmentHelp": "Sao chép môi trường nguồn sang môi trường đích",
  "AdminCopyEnvironmentNameHelp": "Tên môi trường đích",
  "AdminCopyEnvironmentSourceIdHelp": "Id của môi trường nguồn đang được sao chép",
  "AdminCopyEnvironmentSourceUrlHelp": "Url của môi trường nguồn đang được sao chép",
  "AdminCopyEnvironmentTargetIdHelp": "Id môi trường đích",
  "AdminCopyEnvironmentTargetUrlHelp": "Url môi trường đích",
  "AdminCopySourceEnvironmentHelp": "URL hoặc ID môi trường của môi trường nguồn đang được sao chép",
  "AdminCopyTargetEnvironmentHelp": "URL hoặc ID môi trường của môi trường đích",
  "AdminCopyingEnvironment": "Đang sao chép môi trường...",
  "AdminDeleteEnvironmentError": "Thao tác xóa môi trường không thành công",
  "AdminDeleteEnvironmentHelp": "Xóa môi trường khỏi đối tượng thuê của bạn",
  "AdminDeleteEnvironmentIdHelp": "Id của môi trường cần xóa",
  "AdminDeleteEnvironmentInfo": "Xóa {0} khỏi đối tượng thuê của bạn...",
  "AdminDeleteEnvironmentParamHelp": "URL môi trường của hoặc ID của môi trường cần được xóa khỏi đối tượng thuê của bạn.",
  "AdminDeleteEnvironmentResponse": "Môi trường {0} đã được xóa thành công khỏi đối tượng thuê của bạn",
  "AdminDeleteEnvironmentUrlHelp": "URL của Môi trường cần được xóa khỏi đối tượng thuê của bạn",
  "AdminEnvironmentCurrencyHelp": "Đặt đơn vị tiền dùng cho môi trường của bạn. [mặc định là USD]",
  "AdminEnvironmentDomainHelp": "Tên miền là một phần của URL môi trường. Nếu tên miền đã được sử dụng, một giá trị số sẽ được gắn thêm vào tên miền. Ví dụ: Nếu \"contoso\" đã được sử dụng thì URL môi trường sẽ được cập nhật thành https://{contoso}0.crm.dynamics.com.",
  "AdminEnvironmentDomainRegexHelp": "Chỉ cho phép các ký tự trong phạm vi [A - Z], [a - z], [0 - 9] hoặc '-'. Ký tự đầu tiên và cuối cùng không được là ký tự '-'. Không được phép dùng các ký tự '-' liên tiếp.",
  "AdminEnvironmentIdNotFound": "Môi trường có URL “{0}” không có trong đối tượng thuê của bạn.",
  "AdminEnvironmentIdWithBackups": "ID của môi trường có các bản sao lưu.",
  "AdminEnvironmentLanguageHelp": "Đặt ngôn ngữ dùng cho môi trường của bạn. [mặc định là tiếng Anh]",
  "AdminEnvironmentLocationHelp": "Đặt tên vùng lãnh thổ của môi trường. [mặc định là Hoa Kỳ]",
  "AdminEnvironmentMatchingFilterCriteriaNotFound": "Không tìm thấy môi trường nào trong đối tượng thuê của bạn phù hợp với các tiêu chí lọc đã chỉ định.",
  "AdminEnvironmentNameHelp": "Đặt tên của môi trường.",
  "AdminEnvironmentNotFound": "Không tìm thấy môi trường nào trong đối tượng thuê của bạn.",
  "AdminEnvironmentPurposeHelp": "Đặt nội dung mô tả dùng để liên kết môi trường với một ý định cụ thể.",
  "AdminEnvironmentRestore": "Đã hoàn thành thao tác khôi phục môi trường với trạng thái: “{0}”.",
  "AdminEnvironmentTeamIdHelp": "ID nhóm dưới dạng Guid",
  "AdminEnvironmentTeamIdInvalid": "ID nhóm không phải là một Guid hợp lệ.",
  "AdminEnvironmentTemplateHelp": "Đặt ứng dụng Dynamics 365 cần triển khai. [được chuyển dưới dạng các giá trị được phân tách bằng dấu phẩy] ví dụ: -tm \"D365_Sample, D365_Sales\"",
  "AdminEnvironmentTypeHelp": "Đặt Loại môi trường.",
  "AdminEnvironmentUrlWithBackups": "URL của môi trường có các bản sao lưu.",
  "AdminEnvironmentWithIdNotFound": "Môi trường có ID {0} không xuất hiện trong đối tượng thuê của bạn.",
  "AdminEnvironmentWithUrlNotFound": "Môi trường có URL {0} không xuất hiện trong đối tượng thuê của bạn.",
  "AdminHelp": "Hoạt động với Tài khoản quản trị PowerPlatform của bạn",
  "AdminListBackupsEnvironmentParamHelp": "Liệt kê tất cả các môi trường có ID hoặc URL môi trường có chứa chuỗi đã cho.",
  "AdminListEnvironmentBackupsHelp": "Liệt kê tất cả các bản sao lưu môi trường của bạn.",
  "AdminListEnvironmentHelp": "Liệt kê tất cả các môi trường từ đối tượng thuê của bạn",
  "AdminListEnvironmentIdHelp": "Liệt kê tất cả các môi trường có id chứa chuỗi đã cung cấp.",
  "AdminListEnvironmentNameHelp": "Liệt kê tất cả các môi trường có tên chứa chuỗi đã cung cấp.",
  "AdminListEnvironmentParamHelp": "Liệt kê tất cả các môi trường có tên hoặc ID chứa chuỗi đã cung cấp.",
  "AdminListEnvironmentTypeHelp": "Liệt kê tất cả các môi trường thuộc loại đã cung cấp.",
  "AdminListEnvironmentUrlHelp": "Liệt kê tất cả các môi trường có url chứa chuỗi đã cung cấp.",
  "AdminListOrganizationIdHelp": "Liệt kê tất cả các môi trường có id tổ chức chứa chuỗi đã cung cấp.",
  "AdminListingEnvironment": "Đang liệt kê tất cả các môi trường từ đối tượng thuê của bạn...",
  "AdminPollingCompleted": "Đã hoàn tất kiểm tra vòng với mã trạng thái: {0}",
  "AdminPollingRequest": "Kiểm tra vòng để kiểm tra trạng thái Môi trường của bạn... Thời gian thực thi: {0}",
  "AdminResetEnvironmentHelp": "Đặt lại môi trường từ đối tượng thuê của bạn",
  "AdminResetEnvironmentIdHelp": "ID của môi trường cần đặt lại",
  "AdminResetEnvironmentParamHelp": "URL hoặc ID của môi trường cần đặt lại.",
  "AdminResetEnvironmentUrlHelp": "URL của môi trường cần đặt lại",
  "AdminResettingEnvironment": "Đang đặt lại môi trường...",
  "AdminRestoreSourceEnvironmentHelp": "URL hoặc ID môi trường của môi trường nguồn cần thiết cho việc khôi phục.",
  "AdminRestoreTargetEnvironmentHelp": "URL hoặc ID môi trường của môi trường đích cần thiết cho việc khôi phục. Giá trị này sẽ mặc định là URL/ID nguồn nếu không được cung cấp.",
  "AliasWithColon": "(bí danh: {0})",
  "ApplicationHelp": "Các lệnh để liệt kê và cài đặt những ứng dụng Dataverse có sẵn từ AppSource",
  "ApplicationInstallEnvironmentHelp": "Ứng dụng môi trường đích sẽ được cài đặt để",
  "ApplicationInstallHelp": "Cài đặt ứng dụng Dataverse vào môi trường đã cho",
  "ApplicationInstallNameHelp": "Tên duy nhất của ứng dụng sẽ được cài đặt vào môi trường đích",
  "ApplicationInstallSuccess": "Đã cài đặt ứng dụng thành công",
  "ApplicationJsonListHelp": "Vị trí của tệp JSON với danh sách các ứng dụng Dataverse từ AppSource sẽ cài đặt",
  "ApplicationJsonOutputHelp": "Vị trí của tệp JSON sẽ được tạo với danh sách các ứng dụng Dataverse từ AppSource",
  "ApplicationListEnvironmentHelp": "Liệt kê các ứng dụng Dataverse có sẵn cho môi trường nhất định; nếu không được chỉ định, hãy liệt kê tất cả các ứng dụng trong đối tượng thuê (mặc định: danh sách cho tất cả các môi trường)",
  "ApplicationListHelp": "Liệt kê các ứng dụng Dataverse có sẵn từ AppSource",
  "ApplicationPolling": "Kiểm tra vòng để kiểm tra trạng thái Ứng dụng của bạn... Thời gian thực thi: {0}",
  "ArgsFileInputArgumentHelp": "Các đối số động từ sẽ được chuyển vào tệp đầu vào .json. Ví dụ: {\"name\" : \"contoso\"}. Các đối số được truyền qua dòng lệnh sẽ được ưu tiên so với các đối số từ tệp đầu vào .json.",
  "AsyncOperationArgumentHelp": "Đối số boolean không bắt buộc để chạy không đồng thời các động từ pac, mặc định là sai.",
  "AsyncOperationsStatusInfo": "Đã kích hoạt hoạt động không đồng thời. Vui lòng sử dụng “pac admin status” để kiểm tra trạng thái của các hoạt động không đồng thời.",
  "AsyncProcessPollingMessage": "Đang xử lý yêu cầu không đồng thời... thời gian thực thi: {0} và đã hoàn thành {1}%",
  "AsyncProcessSuccessfullyCompleted": "Đã hoàn tất công việc không đồng thời sau {0} và đã hoàn thành 100%",
  "AuthClearComplete": "Đã xóa hồ sơ xác thực và bộ đệm ẩn của mã thông báo",
  "AuthClearHelp": "Xóa tất cả hồ sơ xác thực được lưu trữ trên máy tính này",
  "AuthCreateApplicationIdHelp": "Tùy chọn: ID ứng dụng để xác thực",
  "AuthCreateApplicationIdValidationHelp": "ID ứng dụng không được là chuỗi trống.",
  "AuthCreateAuthenticationFlowValidationHelp": "Phải chọn tên người dùng/mật khẩu, thông tin xác thực máy khách hoặc mã thiết bị làm dòng quy trình xác thực.",
  "AuthCreateClientSecretHelp": "Tùy chọn: Khóa bí mật máy khách để xác thực",
  "AuthCreateClientSecretValidationHelp": "Khóa bí mật máy khách không được là chuỗi trống.",
  "AuthCreateClientTenantHelp": "ID đối tượng thuê nếu sử dụng ID và mã bí mật của ứng dụng.",
  "AuthCreateClientTenantRequiredHelp": "Bắt buộc phải có ID đối tượng thuê khi tạo hồ sơ xác thực ID và mã bí mật của ứng dụng",
  "AuthCreateClientTenantValidationHelp": "Giá trị ID đối tượng thuê không phải là một GUID hợp lệ",
  "AuthCreateCloudInstanceHelp": "Tùy chọn: Phiên bản đám mây để xác thực",
  "AuthCreateDeviceCodeSwitchHelp": "Sử dụng dòng quy trình AAD DeviceCode để đăng nhập tương tác.",
  "AuthCreateHelp": "Tạo và lưu trữ các hồ sơ xác thực trên máy tính này",
  "AuthCreateKindHelp": "Loại hồ sơ xác thực bạn đang tạo, mặc định là Dataverse",
  "AuthCreateKindValidationHelp": "Giá trị '{0}' đã được chuyển cho {1} không hợp lệ. Các loại hợp lệ: {2}.",
  "AuthCreatePasswordHelp": "Tùy chọn: Mật khẩu để xác thực",
  "AuthCreatePasswordValidationHelp": "Mật khẩu không được là chuỗi trống.",
  "AuthCreateResourceHelp": "URL tài nguyên để kết nối",
  "AuthCreateResourceValidationHelp": "Giá trị '{0}' được chuyển cho {1} là URL hoặc Guid không hợp lệ.",
  "AuthCreateSuccess": "Đã tạo xác thực thành công.",
  "AuthCreateUsernameHelp": "Tùy chọn: Tên người dùng để xác thực; hiển thị hộp thoại AAD nếu không được chỉ định",
  "AuthCreateUsernameValidationHelp": "Tên người dùng không được là một chuỗi trống; định dạng điển hình là: “user@contoso.onmicrosoft.com”",
  "AuthDeleteHeader": "Hồ sơ đã xóa:",
  "AuthDeleteHelp": "Xóa một hồ sơ xác thực cụ thể",
  "AuthDeleteIndexHelp": "Chỉ mục của hồ sơ sẽ xóa",
  "AuthHelp": "Quản lý cách bạn xác thực các dịch vụ khác nhau",
  "AuthListHeader": "Hồ sơ (* biểu thị trạng thái đang hoạt động):",
  "AuthListHelp": "Liệt kê các hồ sơ xác thực được lưu trữ trên máy tính này",
  "AuthListNoProfiles": "Không tìm thấy hồ sơ nào trên máy tính này. Vui lòng chạy '{0}' để tạo một hồ sơ.",
  "AuthNameHeader": "Hồ sơ sau đây đã được đặt tên:",
  "AuthNameHelp": "Đặt tên hoặc đổi tên hồ sơ xác thực hiện có",
  "AuthNameIndexHelp": "Chỉ mục của hồ sơ sẽ được đặt tên/đổi tên",
  "AuthNameInvalidLength": "Độ dài của tên phải nằm trong khoảng từ 1 đến 12",
  "AuthNameNameHelp": "Tên bạn muốn đặt cho hồ sơ xác thực này (tối đa 12 ký tự)",
  "AuthNameProfileFailure": "Các hồ sơ hiện tại trên máy có bản sao. Hãy chạy {0} sau đó tạo lại hồ sơ mới.",
  "AuthNoAuthority": "Không thể lấy địa chỉ ủy quyền cho URL {0}",
  "AuthProfileExpired": "(đã hết hạn {0} phút trước)",
  "AuthProfileExpiresIn": "(hết hạn sau {0} phút)",
  "AuthProfileInvalid": "Hồ sơ hiện tại không đủ thông tin. Hồ sơ này có thể đã được tạo bằng phiên bản CLI cũ. Hãy chạy '{0}' sau đó tạo lại một hồ sơ mới.",
  "AuthProfileNameAlreadyExist": "Tên được cung cấp đã tồn tại.",
  "AuthProfileNameDoesNotExist": "Không có hồ sơ xác thực nào có tên \"{0}\"",
  "AuthProfileNoneOfKind": "Không tìm thấy hồ sơ {0} nào trên máy tính này. Vui lòng chạy '{1}' để tạo một hồ sơ.",
  "AuthProfileOfServicePrincipalLacksResourcePermission": "ServicePrincipal của bạn thiếu các quyền đối với nguồn lực “{0}”. Vui lòng chuyển sang hồ sơ khác hoặc cấp quyền cho Ứng dụng và tạo lại hồ sơ.",
  "AuthProfileUseExpired": "Bạn đang cố gắng dùng hồ sơ xác thực đã hết hạn. Vui lòng chuyển sang hồ sơ khác hoặc xóa và tạo lại hồ sơ.",
  "AuthSelectHeader": "Hồ sơ mặc định mới:",
  "AuthSelectHelp": "Chọn hồ sơ xác thực sẽ hoạt động",
  "AuthSelectIndexHelp": "Chỉ mục của hồ sơ sẽ hoạt động",
  "AuthSelectIndexNotValid": "Giá trị {0} của {1} không hợp lệ. Giá trị này phải nằm trong khoảng từ 1 đến {2}.",
  "AuthSelectNameHelp": "Tên của hồ sơ sẽ hiện hoạt",
  "AuthSelectNoIndexOrNameProvided": "Không có chỉ mục hoặc tên được cung cấp",
  "AuthValidatingConnection": "Đang xác thực kết nối...",
  "BackingUpEnvironment": "Sao lưu môi trường của bạn với nhãn: {0}",
  "BackupEnvironmentHelp": "Thực hiện sao lưu thủ công môi trường của bạn.",
  "BackupEnvironmentIdHelp": "ID của môi trường yêu cầu sao lưu.",
  "BackupEnvironmentUrlHelp": "URL của môi trường yêu cầu sao lưu.",
  "BackupLabelHelp": "Đặt nhãn sao lưu như được cung cấp.",
  "BackupNotesHelp": "Ghi chú bổ sung cho bản sao lưu này.",
  "BiConditionalArguments": "Cả hai trường của cặp {0} là bắt buộc.",
  "BuildVersionUpdateStrategyHelp": "Cập nhật phiên bản build cho các tệp “Solution.xml” bằng chiến lược đã chỉ định. Nếu sử dụng gittags, hãy đặt personal access token trong biến môi trường “PacCli.PAT”",
  "CannotProcessCommand": "'{0}' đã được sử dụng nhưng lệnh trước không biết cách xử lý mục này.",
  "CanvasModuleHelp": "Hoạt động với các tệp .msapp trên Power Apps",
  "CanvasPackHelp": "Đóng gói các nguồn vào một tệp msapp",
  "CanvasPackMsAppHelp": "Đường dẫn đến tệp .msapp",
  "CanvasPackSourcesHelp": "Thư mục đến các nguồn được đóng gói",
  "CanvasUnpackHelp": "Trích xuất tệp msapp vào các nguồn",
  "CanvasUnpackSourcesHelp": "Thư mục đến các nguồn được mở gói",
  "CdsAuthKindCannotResolveAuthority": "Không thể giải quyết quyền AAD/OAuth cho {0}",
  "CdsAuthKindValidationUrlNotSpecified": "Để tạo hồ sơ, phải chỉ định URL Dataverse bằng đối số --url",
  "CdsAuthKindValidationUrlNotValid": "URL \"{0}\" không phải là Dataverse URL hợp lệ. URL phải sử dụng giao thức HTTPS an toàn.",
  "CliCompleteHelp": "Hiển thị danh sách các từ tự động hoàn tất",
  "CliCompleteSentenceHelp": "Một phần của câu cần hoàn thành",
  "CliHelpHelp": "Hiển thị thông tin trợ giúp cho Microsoft PowerPlatform CLI",
  "CliTelemetryDisableHelp": "Chọn không gửi thông tin sử dụng để giúp Microsoft cải thiện sản phẩm này",
  "CliTelemetryDisabled": "Đã vô hiệu hóa bộ sưu tập phương pháp đo từ xa.",
  "CliTelemetryEnableHelp": "Chọn gửi thông tin sử dụng để giúp Microsoft cải thiện sản phẩm này",
  "CliTelemetryEnabled": "Đã kích hoạt bộ sưu tập phương pháp đo từ xa.",
  "CliTelemetryHelp": "Quản lý cài đặt phương pháp đo từ xa",
  "CliTelemetryStatusDisabled": "Phương pháp đo từ xa hiện đang tắt",
  "CliTelemetryStatusEnabled": "Phương pháp đo từ xa hiện đang bật",
  "CliTelemetryStatusHelp": "Hiển thị trạng thái hiện tại của phương pháp đi từ xa",
  "CommandDoesNotTakeArguments": "Lệnh này không có bất kỳ đối số nào.",
  "CommandDoesNotTakeSubCommands": "Lệnh này không có bất kỳ lệnh con nào.",
  "CommandNotUnderstood": "Không hiểu lệnh '{0}' trong ngữ cảnh này.",
  "CommandsWithColon": "Lệnh: ",
  "ConnectedTo": "Đã kết nối với...",
  "ConnectionEnvironmentIdHelp": "ID của môi trường có các kết nối.",
  "ConnectionHelp": "Những lệnh để làm việc với kết nối Dataverse.",
  "ConnectionListHelp": "Liệt kê tất cả các Kết nối từ môi trường đã truyền qua.",
  "ConnectionNotFound": "Không tìm thấy kết nối nào trong môi trường đã truyền qua.",
  "CorruptAuthToken": "Không thể đọc mã thông báo xác thực. Vui lòng chạy 'pac auth create' để tạo một mã xác thực mới.",
  "CorruptedFeatureFlagsFile": "Tệp cờ tính năng {0} bị lỗi.",
  "CouldNotFindDirectoryForJsonInputFile": "Không tìm thấy thư mục được chỉ định cho tệp đầu vào .json được cung cấp.",
  "CouldNotFindJsonInputFile": "Không tìm thấy tệp đầu vào .json được cung cấp.",
  "CreateEnvironmentHelp": "Tạo Môi trường Dataverse trong đối tượng thuê của bạn.",
  "CreateEnvironmentInfo": "Tạo {0} Môi trường Dataverse trong đối tượng thuê của bạn.",
  "CreateEnvironmentWithNameWarning": "Không thể chỉ định tên cho môi trường Teams. Đối số {0} bị bỏ qua",
  "CreateSettingsExtractionRoot": "Trích xuất thông tin tham chiếu kết nối Dataverse và/hoặc các biến môi trường từ: {0}",
  "CreateSettingsSettingsFileCreated": "Đã tạo tệp thiết đặt triển khai: {0}",
  "CreateSettingsSolutionFolderHelp": "Đường dẫn đến thư mục giải pháp cục bộ, đã được mở gói: thư mục gốc của tệp “Other/Solution.xml” hoặc một thư mục có tệp .cdsproj.",
  "CreateSettingsSolutionZipHelp": "Đường dẫn đến tệp zip giải pháp.",
  "DeprecatedArgumentError": "Đối số {0} không được dùng nữa và không còn được hỗ trợ.",
  "DeprecatedArgumentHelpTextFormat": "(không còn dùng) {0}",
  "DeprecatedArgumentIgnored": "Đối số {0} không còn được dùng nữa và sẽ bị bỏ qua.",
  "DeprecatedArgumentReplaced": "Đối số {0} sẽ sớm không được dùng nữa. Thay vào đó, hãy dùng {1}.",
  "DirectoryNameIsInvalid": "Tên thư mục không hợp lệ",
  "DotnetCommandError_ExitCode": "Đã xảy ra lỗi không mong muốn khi thực thi nội bộ lệnh CLI dotnet (mã thoát: {0}).",
  "DotnetConfigurationError_ExitCode": "Đã xảy ra lỗi cấu hình CLI dotnet (mã thoát: {0}). Xác minh rằng tệp global.json của bạn được đặt cấu hình chính xác và đã cài đặt SDK và môi trường thời gian chạy bắt buộc. Quá trình chạy “dotnet --version” sẽ hoạt động tốt mà không có lỗi.",
  "DotnetNotFound_MinV": "Không tìm thấy CLI DotNet. Hãy đảm bảo rằng bạn đã cài đặt CLI DotNet (https://dotnet.microsoft.com/download/dotnet) và giao diện đó có sẵn thông qua biến môi trường PATH. Phiên bản tối thiểu được hỗ trợ: {0}.",
  "DotnetSdkVersionNotSupported_Version_MinV": ".NET SDK (phiên bản {0}) đang được đặt cấu hình không được hỗ trợ cho hành động này. Phiên bản thấp nhất được hỗ trợ: {1}. Bạn có thể đặt cấu hình phiên bản .NET SDK bằng cách sử dụng một global.json thích hợp trong thư mục làm việc hiện tại của mình.",
  "DotnetSdkVersionNotSupported_Version_MinV_MaxV": ".NET SDK (phiên bản {0}) đang được đặt cấu hình không được hỗ trợ cho hành động này. Phiên bản thấp nhất được hỗ trợ: {1}. Phiên bản cao nhất được hỗ trợ (không bao gồm phiên bản cao nhất này): {2}. Bạn có thể đặt cấu hình phiên bản .NET SDK bằng cách sử dụng một global.json thích hợp trong thư mục làm việc hiện tại của mình.",
  "EnvironmentBackupsNotFound": "Không tìm thấy bản sao lưu nào cho môi trường đã nêu.",
  "EnvironmentIdIsInvalid": "ID môi trường đã nhập không hợp lệ.",
  "EnvironmentOverrideArgumentHelp": "ID môi trường mục tiêu. Giá trị mặc định là môi trường của Hồ sơ xác thực Dataverse đang hiện hoạt của bạn.",
  "EnvironmentOverrideParamHelp": "ID hoặc URL của môi trường đích. Giá trị mặc định là môi trường của Hồ sơ xác thực Dataverse đang hiện hoạt của bạn.",
  "EnvironmentParsingError": "Đã xảy ra lỗi khi phân tích dữ liệu. Còn thiếu thuộc tính \"{0}\".",
  "EnvironmentRuntimeStateChanged": "Đã thay đổi trạng thái thời gian chạy cho môi trường của bạn bằng mã trạng thái: {0}",
  "ErrorHandlingFile": "Đã xảy ra IOException khi đang xử lý tệp: {0}",
  "ErrorReadingJsonInputFile": "Json không hợp lệ trong tệp .json được cung cấp.",
  "ErrorRunningTool": "Lỗi khi chạy công cụ: {0} với các đối số: {1}.",
  "ErrorWithColon": "Lỗi: ",
  "FileAt": "  Tệp tại {0}.",
  "FileNotFound": "Không tìm thấy tệp: {0}",
  "HelpWithColon": "Trợ giúp: ",
  "HintsWithColon": "Gợi ý: ",
  "InitFailure": "Không tạo được dự án {0}. Thư mục hiện tại đã chứa một dự án. Vui lòng tạo một thư mục mới và thử lại thao tác.",
  "IntegersOnlyRegexHelp": "Giá trị phải là một số nguyên dương",
  "InvalidAppTemplate": "Mẫu ứng dụng không hợp lệ “{0}”. Vui lòng chọn một giá trị mẫu hợp lệ từ các giá trị sau: “{1}”.",
  "InvalidArgumentFormat": "Đối số {0} không hợp lệ. Loại dự kiến {1} và nhận được: {2}",
  "InvalidArgumentInputDirectoryNotFound_Path": "Không tìm thấy thư mục “{0}”.",
  "InvalidArgumentInputFileExtensionNotAllowed_FileName_AllowedExtensions": "Tệp “{0}” có phần mở rộng tệp không hợp lệ. Phần mở rộng tệp được phép: {1}",
  "InvalidArgumentInputFileNotFound_Path": "Không tìm thấy tệp “{0}”.",
  "InvalidArgumentSolutionFileInvalidFormat_FilePath": "Tệp \"{0}\" không phải là tệp giải pháp hợp lệ.",
  "InvalidArgumentValue": "Giá trị {0} của đối số không chính xác: {1}.",
  "InvalidArgumentValueLength": "Đối số {0} có độ dài không chính xác. Độ dài của đối số phải nằm trong khoảng từ {1} đến {2}.",
  "InvalidCurrencyCode": "Mã tiền tệ không hợp lệ \"{0}\". Vui lòng chọn một mã tiền tệ hợp lệ ở bên dưới: \"{1}\".",
  "InvalidEnvironmentParamValue": "Giá trị không hợp lệ cho tham số môi trường: “{0}”. Vui lòng chuyển một URL hợp lệ hoặc một GUID hợp lệ. Ví dụ: “https://contoso.crm.dynamics.com” HOẶC GUID gồm 36 ký tự (có dấu gạch nối).",
  "InvalidFrameworkValue": "Kể từ bây giờ, giá trị khung “{0}” sẽ không được hỗ trợ.",
  "InvalidLanguageName": "Ngôn ngữ không hợp lệ \"{0}\". Vui lòng chọn một ngôn ngữ hợp lệ ở bên dưới: \"{1}\".",
  "InvalidProjectDirectoryName": "Tên dự án trống hoặc không hợp lệ {0}",
  "InvalidProjectFileExtension_ProjectFileName_ValidExtensions": "Tệp dự án không hợp lệ {0}. Phần mở rộng tệp được phép: {1}.",
  "InvalidSwitchArgumentValue": "Giá trị được chuyển đến {0} không hợp lệ. Nếu không có giá trị nào được chuyển đi, đối số sẽ mặc định là true. Giá trị: true, false.",
  "InvalidUriArgumentValue": "Giá trị đã chuyển tới {0} không hợp lệ.",
  "ListingEnvironmentBackups": "Đang liệt kê tất cả các bản sao lưu môi trường của bạn với Url : {0}",
  "LogFileNameIsInvalid": "Tên tệp nhật ký không hợp lệ: {0}",
  "MaxAsyncWaitTimeHelp": "Thời gian chờ không đồng thời tối đa tính bằng phút. Giá trị mặc định là 60 phút",
  "MissingFeatureFlagsFile": "Thiếu tệp cờ tính năng {0}.",
  "MissingRequiredArgValue": "Đối số \"{0}\" phải có một giá trị đã chỉ định.",
  "MissingRequiredArgument": "Thiếu đối số bắt buộc {0}.",
  "MissingRequiredTool": "Thiếu công cụ bắt buộc: {0}. Vui lòng thêm {0} vào biến số môi trường Path hoặc dùng 'Developer Command Prompt for VS'.",
  "MissingSubCommand": "Thiếu một lệnh con.",
  "MultipleFilesFoundMatchingSearchPattern_Folder_Pattern": "Đã tìm thấy nhiều tệp trong thư mục “{0}” khớp với mẫu tìm kiếm “{1}”.",
  "MultipleProjectsFound": "Đã tìm thấy nhiều tệp dự án có phần mở rộng {0} trong thư mục {1}.",
  "MultipleSolutionRootsFound": "Tìm thấy nhiều thư mục gốc giải pháp trong thư mục “{0}” (đang tìm tệp .cdsproj hoặc “Other/solution.xml” để suy luận). Vui lòng chỉ định gốc giải pháp để tập trung vào. Đã tìm thấy: {1}",
  "MutuallyExclusiveArguments_2": "Phải cung cấp {0} hoặc {1}, nhưng không phải cả hai.",
  "MutuallyExclusiveArguments_3": "Phải cung cấp {0} hoặc {1} hoặc {2}.",
  "MutuallyExclusiveOrNeitherArguments_2": "Chỉ được cung cấp một trong số {0} hoặc {1} hoặc không.",
  "MutuallyExclusiveOrNeitherArguments_3": "Chỉ được cung cấp một trong số {0} hoặc {1} hoặc {2} hoặc không.",
  "NewProjectFolderPathNotEmpty": "Không thể tạo dự án vì thư mục không trống.",
  "NewVersionFound": "LƯU Ý: Đã tìm thấy phiên bản mới. Hãy chạy 'pac tool {0} --install' để cài đặt phiên bản mới nhất.",
  "NoResultsReturned": "Không có kết quả nào trả về.",
  "NoVersionAttribute": "{0} bị thiếu một thuộc tính phiên bản.",
  "NoWasItMisspelled": "Không, từ này sai chính tả?",
  "NoWrapInQuotes": "Không, hãy nhớ ngắt các giá trị chứa dấu cách.",
  "NoneInParenthesis": "(Không)",
  "NotAGitRepo": "Dự án không phải là một kho lưu trữ git hợp lệ",
  "NotValidCommand": "Lệnh không hợp lệ. Hãy thử chạy '{0} [command] help'.",
  "OptionsWithColon": "Tùy chọn: ",
  "OrgConnectionFailed": "Không thể kết nối với Tổ chức Dataverse tại {0}.",
  "OrgEntityEntityNameHelp": "Tên thực thể",
  "OrgEntityGetFieldsHeader": "{0} ({1}) Trường:",
  "OrgEntityGetFieldsHelp": "Hiển thị các trường của một thực thể",
  "OrgEntityGetFieldsLine": "{0} ({1})",
  "OrgEntityGetRecordsFieldNotValid": "Không thể tìm thấy trường '{0}' trong '{1}'. Bạn có thể chạy '{2} {3} {4} {5}' để xem danh sách các trường.",
  "OrgEntityGetRecordsFieldsHelp": "Danh sách các trường của thực thể này để có được (* cho tất cả)",
  "OrgEntityGetRecordsHeader": "Bản ghi #{0}",
  "OrgEntityGetRecordsHelp": "Hiển thị một bản ghi cụ thể của một thực thể",
  "OrgEntityGetRecordsIdHelp": "ID bản ghi cần lấy",
  "OrgEntityGetRecordsIdNotValid": "ID được chuyển đi không phải là một Guid hợp lệ.",
  "OrgEntityHelp": "Nhận thông tin về một thực thể trong Dataverse",
  "OrgEnvironmentId": "ID môi trường:",
  "OrgFriendlyName": "Tên dễ nhớ:",
  "OrgHelp": "Làm việc với Tổ chức Dataverse của bạn",
  "OrgId": "ID tổ chức:",
  "OrgListHelp": "Liệt kê tất cả các Tổ chức Dataverse mà người dùng có quyền truy cập",
  "OrgListRequiresUserProfile": "Danh sách tổ chức yêu cầu hồ sơ xác thực Người dùng, không phải hồ sơ xác thực Ứng dụng",
  "OrgQueryHelp": "Hiển thị kết quả của truy vấn đối với Dataverse",
  "OrgQueryRowHeader": "Hàng #{0}",
  "OrgQuerySqlHelp": "Truy vấn SQL SELECT để chạy",
  "OrgResultRow": "{0}: {1}",
  "OrgUniqueName": "Tên duy nhất:",
  "OrgUrl": "URL tổ chức:",
  "OrgUserId": "ID người dùng:",
  "OrgWhoHelp": "Hiển thị thông tin về Tổ chức Dataverse hiện tại",
  "OrganizationInformation": "Thông tin tổ chức",
  "PAPortalBundleHelp": "Gói nội dung trang web cổng thông tin ở định dạng XML được CMT hỗ trợ",
  "PAPortalDownloadHelp": "Tải nội dung trang web cổng thông tin xuống từ Tổ chức Dataverse hiện tại",
  "PAPortalDownloadSucceeded": "Tải cổng thông tin xuống thành công trong {0} giây",
  "PAPortalHelp": "Các lệnh để làm việc với trang web cổng thông tin PowerApps",
  "PAPortalListHelp": "Liệt kê tất cả các trang web cổng thông tin từ Tổ chức Dataverse hiện tại",
  "PAPortalReguidHelp": "Gán GUID mới cho thuộc tính khóa chính cho tất cả các bản ghi của một trang web",
  "PAPortalUploadHelp": "Tải nội dung trang web cổng thông tin lên Tổ chức Dataverse hiện tại",
  "PAPortalUploadSucceeded": "Tải lên cổng thông tin thành công",
  "PCFPatchVersionUpdateStartegyHelp": "Cập nhật phiên bản patch cho các tệp “ControlManifest.xml” bằng chiến lược đã chỉ định. Nếu sử dụng gittags, hãy đặt personal access token trong biến môi trường “PacCli.PAT”",
  "PackSolutionProcessEnd": "Đã đóng gói giải pháp.",
  "PackSolutionProcessStart": "Đang đóng gói giải pháp...",
  "PackageAddExternalPackage": "Thêm một gói bên ngoài vào dự án Gói PD",
  "PackageAddExternalPackageArgumentPackageType": "Loại gói được thêm vào. Ví dụ: “xpp” cho các gói FnO.",
  "PackageAddExternalPackageArgumentPath": "Đường dẫn đến gói bên ngoài",
  "PackageAddItemToProjectSuccess": "Đã thêm mục thành công.",
  "PackageAddProjectItemArgumentImportOrder": "Một số nguyên cho biết thứ tự chèn mục này vào tệp ImportConfig.xml cuối cùng tại thời điểm dựng. Số âm được chèn vào trước các phần tử hiện có. Số dương được thêm vào sau các phần tử hiện có.",
  "PackageAddProjectItemArgumentSkipValidation": "Thêm mục này vào tệp dự án ngay cả khi tệp không tồn tại hoặc tệp có vẻ không hợp lệ. Lưu ý là điều này sẽ không ảnh hưởng đến bất kỳ thao tác xác thực nào mà MSBuild thực hiện.",
  "PackageAddReference": "Thêm thông tin tham chiếu vào dự án giải pháp Dataverse",
  "PackageAddReferencePathSwitch": "Đường dẫn đến dự án giải pháp Dataverse được tham chiếu",
  "PackageAddReferenceSuccess": "Đã thêm thành công thông tin tham chiếu Dự án Dataverse vào gói.",
  "PackageAddSolution": "Thêm một tệp giải pháp Dataverse dựng sẵn vào dự án Gói PD",
  "PackageAddSolutionArgumentPath": "Đường dẫn đến tệp giải pháp Dataverse (phải là *.zip)",
  "PackageArgumentHelp": "đường dẫn đến một dll gói hoặc tệp zip kèm theo gói",
  "PackageDeployHelp": "Triển khai gói cho môi trường Dataverse",
  "PackageDeployedSuccessfully": "Đã triển khai gói thành công",
  "PackageHelp": "Lệnh để làm việc với các dự án gói Dataverse",
  "PackageInitArgumentIncludePkgAssetsContent": "Cho biết có bao gồm một số tệp mẫu cho thư mục PkgAssets/Content hay không.",
  "PackageInitArgumentPackageName": "Thiết đặt tên mặc định của gói. Áp dụng cho việc tạo ImportExtension.GetNameOfImport.",
  "PackageInitArgumentTemplate": "Tên của mẫu sẽ tạo phiên bản. Ghi chú: mẫu “cũ” sẽ bị xóa trong bản phát hành sau này.",
  "PackageInitHelp": "Khởi tạo một thư mục với dự án gói Dataverse mới",
  "PackageInitSuccess": "Đã tạo thành công gói dự án trong “{0}”.",
  "PackageInvalidFileName": "\"{0}\" – tên dll gói hoặc tệp zip không hợp lệ",
  "PackageProjectFileNotSupported_ProjectFileName": "Dự án “{0}” không được hỗ trợ với hành động này. Đảm bảo rằng dự án đã được tạo bằng lệnh gọi mới nhất tới “pac package init”.",
  "PackageShowDescription": "Mô tả: {0}",
  "PackageShowError": "Không thể phân tích cú pháp gói: {0}",
  "PackageShowHelp": "Hiển thị chi tiết về gói Dataverse",
  "PackageShowLocation": "Vị trí: {0}",
  "PackageShowLongName": "Tên dài: {0}",
  "PackageShowName": "Tên: {0}",
  "PackageShowSolutionDisplayName": "Tên hiển thị giải pháp: {0}",
  "PackageShowSolutionVersion": "Phiên bản giải pháp: {0}",
  "PackageShowSolutions": "Gói chứa {0} giải pháp",
  "ParseExceptionCurrentCommand": "Lệnh hiện tại:",
  "ParseExceptionFailedOn": "Phân tích cú pháp không thành công trên:",
  "ParseExceptionKnownArgument": "Đây có phải là một đối số đã biết không?",
  "ParseExceptionKnownCommand": "Đây có phải là một lệnh đã biết không?",
  "ParseExceptionQuoteWrapped": "Báo giá có được ngắt không?",
  "PatchVersionTrackerFileExtensionError": "Phần mở rộng tên tệp cho chiến lược theo dõi tệp chỉ được phép là CSV",
  "PatchVersionTrackerFileName": "Tên tệp CSV theo dõi sẽ được dùng khi sử dụng filetracking làm chiến lược. Giá trị mặc định là ControlsStateVersionInfo.csv",
  "PathIsNotValid": "Đường dẫn {0} không hợp lệ.",
  "PcfCommitIDError": "Không thể truy xuất id cam kết mới nhất đối với kiểm soát: {0}",
  "PcfControlFolderNameParseError": "Không thể phân tích tên thư mục gốc của kiểm soát: {0}",
  "PcfControlManifestNotFound": "Không thể tìm thấy tệp ControlManifest.Input.xml tại {0}.",
  "PcfControlManifestPathHelp": "Đường dẫn tuyệt đối/tương đối của “ControlManifest.xml” dùng cho việc cập nhật.",
  "PcfControlManifestTooManyFound": "Tìm thấy nhiều tệp ControlManifest.Input.xml tại {0}.",
  "PcfControlNoChangeInResource": "Không có thay đổi nào được phát hiện trong '{0}'.",
  "PcfControlUpdatingResource": "Đang cập nhật '{0}'.",
  "PcfControlVersionFileInvalidContent": "Tìm thấy nội dung không hợp lệ trong {0}",
  "PcfDiscoverAllManifestFilesHelp": "Cập nhật phiên bản patch cho tất cả các tệp “ControlManifest.xml”",
  "PcfHashControlVersionNotMatching": "Phiên bản kiểm soát hàm băm trong {0} không ở định dạng được hỗ trợ để phân tích cú pháp",
  "PcfHelp": "Các lệnh để làm việc với dự án PowerApps component framework",
  "PcfIncludesReservedWord": "Giá trị '{0}' được chuyển cho đối số là hoặc bao gồm một từ dành riêng.",
  "PcfInitFailedNpmCommand": "Không chạy được lệnh: “{0}”. Vui lòng chạy “{0}” trong thư mục này để cài đặt các quan hệ phụ thuộc của dự án.",
  "PcfInitHelp": "Khởi tạo một thư mục có dự án PowerApps component framework mới",
  "PcfInitNameHelp": "Tên của thành phần",
  "PcfInitNameRegexHelp": "Chỉ cho phép các ký tự trong phạm vi [A - Z], [a - z] hoặc [0 - 9]. Ký tự đầu tiên không được là một số.",
  "PcfInitNamespaceHelp": "Vùng tên của thành phần",
  "PcfInitNamespaceRegexHelp": "Chỉ cho phép các ký tự trong phạm vi [A - Z], [a - z], [0 - 9] hoặc '.'. Ký tự đầu tiên và cuối cùng không được là ký tự '.'. Không cho phép các ký tự '.' liên tiếp. Ký tự đầu tiên hoặc ngay sau dấu chấm không được ở dạng số.",
  "PcfInitPackageJsonUpdateError": "Lỗi khi cập nhật phiên bản thư viện nền tảng trong “package.json”. Vui lòng cập nhật thủ công các phiên bản React và Fluent trong tệp “package.json”.",
  "PcfInitPlatformLibrariesVersionError": "Lỗi khi tải phiên bản thư viện nền tảng. Vui lòng cập nhật thủ công các phiên bản React và Fluent.",
  "PcfInitRunNpmInstall": "Hãy nhớ chạy “npm install” hoặc tương đương trong thư mục này để cài đặt quan hệ phụ thuộc cho dự án.",
  "PcfInitRunNpmRefreshTypes": "Vui lòng chạy “npm run refreshTypes” sau “npm install” trong thư mục này để tạo tệp ManifestDesignTypes.d.ts.",
  "PcfInitRunningNpmCommand": "Đang chạy “{0}” cho bạn...",
  "PcfInitSuccessfullyCreatedProject": "Đã tạo thành công dự án PowerApps component framework trong “{0}”.",
  "PcfInitTemplateHelp": "Chọn một mẫu cho thành phần",
  "PcfInvalidGitPAT": "Mã thông báo truy cập cá nhân không hợp lệ/bị thiếu để đẩy thẻ vào gốc từ xa trong biến môi trường {0}",
  "PcfMaximumLengthExceeded": "Tổng chiều dài của các giá trị cho các đối số '{0}' và '{1}' không được vượt quá {2}.",
  "PcfNoManifestFilesFound": "Không thể tìm thấy {0} tệp ở bất kỳ thư mục nào bên trong {1}.",
  "PcfPatchVersionFileNameMisMatchError": "Tệp theo dõi tồn tại với tên: {0}",
  "PcfPatchVersionHelp": "Phiên bản bản vá cho kiểm soát",
  "PcfPatchVersionMultipleTrackerFilesError": "Nhiều tệp csv trong thư mục làm việc cấp cao nhất",
  "PcfPatchVersionUpdateDirectoryHelp": "Chỉ định tệp kê khai mục tiêu cần được cập nhật",
  "PcfProjectNotFound": "Không tìm thấy tệp dự án PowerApps component framework có phần mở rộng pcfproj trong thư mục {0}.",
  "PcfProjectTooManyFound": "Đã tìm thấy nhiều tệp pcfproj tại {0}.",
  "PcfPushBuildExeNotFound": "Không xác định được vị trí dotnet.exe hoặc msbuild.exe để xây dựng giải pháp tạm thời.",
  "PcfPushBuildingTempSolution": "Đang xây dựng trình bao bọc giải pháp tạm thời.",
  "PcfPushCheckingResources": "Kiểm tra bất kỳ thay đổi cho từng nguồn lực.",
  "PcfPushComparingControlManifests": "So sánh bảng kê khai trong tổ chức hiện tại với bảng kê khai tại {0}.",
  "PcfPushControlManifestsDifferent": "Các tệp “ControlManifest.xml” là khác nhau.",
  "PcfPushControlManifestsEqual": "Các tệp “ControlManifest.xml” là giống nhau.",
  "PcfPushControlNotFound": "Kiểm soát không được tìm thấy trong tổ chức hiện tại.",
  "PcfPushDoesControlExistOnOrg": "Kiểm tra xem kiểm soát '{0}' có tồn tại trong tổ chức hiện tại.",
  "PcfPushDone": "Đang cập nhật kiểm soát trong tổ chức hiện tại: xong.",
  "PcfPushForceImportHelp": "Buộc cập nhật đầy đủ các kiểm soát",
  "PcfPushHelp": "Nhập dự án PowerApps component framework vào Tổ chức Dataverse hiện tại",
  "PcfPushLoadingControlFromOrg": "Kiểm soát tồn tại trong tổ chức hiện tại, tải chi tiết của kiểm soát.",
  "PcfPushLocatingResources": "Định vị các tài nguyên web được sử dụng bởi kiểm soát '{0}'.",
  "PcfPushOnlySupportsUnmanaged": "Kiểm soát tồn tại trong tổ chức hiện tại nhưng được quản lý. Các lệnh '{0}' chỉ hoạt động với các kiểm soát không được quản lý.",
  "PcfPushTempSolutionBuildFailed": "Xây dựng trình bao bọc giải pháp tạm thời: không thành công. Xem {0} để biết thêm chi tiết.",
  "PcfPushTempSolutionBuildSucceeded": "Xây dựng trình bao bọc giải pháp tạm thời: hoàn tất.",
  "PcfPushTempSolutionCreated": "Tạo trình bao bọc giải pháp tạm thời: hoàn tất.",
  "PcfPushTempSolutionCreating": "Đang tạo một trình bao bọc giải pháp tạm thời để đẩy thành phần.",
  "PcfPushTempSolutionCreationFailed": "Tạo trình bao bọc giải pháp tạm thời: không thành công, xem nhật ký để biết thêm chi tiết.",
  "PcfPushTempSolutionDoneImport": "Nhập trình bao bọc giải pháp tạm thời vào tổ chức hiện tại: xong.",
  "PcfPushTempSolutionStartImport": "Nhập trình bao bọc giải pháp tạm thời vào tổ chức hiện tại.",
  "PcfPushTempSolutionZipDropped": "Thả tệp nén trình bao bọc giải pháp tạm thời: xong.",
  "PcfPushUnknownError": "Đã xảy ra lỗi khi kiểm tra tổ chức hiện tại: {0}. Quay lại để cập nhật đầy đủ.",
  "PcfPushUsingFullUpdate": "Sử dụng bản cập nhật đầy đủ.",
  "PcfPushUsingIncrementalUpdate": "Sử dụng bản cập nhật gia tăng.",
  "PcfPushVerbosityHelp": "Mức độ chi tiết cho MSBuild khi xây dựng trình bao bọc giải pháp tạm thời.",
  "PcfTagRegExNotMatching": "Tên thẻ không đúng định dạng đối với kiểm soát có các chi tiết sau. ControlName: {0}, CommitID: {1}, Phiên bản:{2}",
  "PcfTrackerFileInvalidPath": "Đường dẫn không hợp lệ cho tệp theo dõi: {0}",
  "PcfVersionDone": "Đã hoàn tất phiên bản patch cho các tệp “ControlManifest.xml” được chỉ định.",
  "PluginHelp": "Các lệnh để làm việc với thư viện lớp phần bổ trợ Dataverse",
  "PluginInitAuthorHelp": "(Các) tác giả của Gói phần bổ trợ Dataverse.",
  "PluginInitHelp": "Khởi tạo một thư mục với thư viện lớp phần bổ trợ Dataverse mới.",
  "PluginInitSigningKeyFilePathHelp": "Đường dẫn tương đối đến tệp khóa của người tạo tập hợp phần bổ trợ Dataverse để ký.",
  "PluginInitSigningKeyFilePathValidationHelp": "Phần mở rộng tệp khóa không hợp lệ: {0}. Vui lòng cung cấp tệp .snk hoặc .pfx hợp lệ cho tập hợp phần bổ trợ Dataverse.",
  "PluginInitSuccess": "Đã tạo thành công thư viện lớp phần bổ trợ Dataverse có tên “{0}” trong thư mục hiện tại.",
  "PortalActionCompleted": "Đã tải xuống: {0} [{1}]",
  "PortalAppsHelp": "Các lệnh liệt kê các ứng dụng và số lượt tải xuống cho người dùng hiện tại",
  "PortalAppsResult": "Danh sách tất cả các ứng dụng cho {0}",
  "PortalBundleConvertedForEntity": "Đã xử lý {0} bản ghi cho bảng: {1}",
  "PortalBundleSavedSeparateXml": "Đã xử lý {0} bản ghi cho bảng: {1} và lưu vào {2}",
  "PortalBundleSavedSingleXml": "Đã lưu xml dữ liệu vào {0}",
  "PortalCDSClientRetryMaxReached": "Đã đạt đến số lần thử lại tối đa để tải máy khách Dataverse. Vui lòng thử lại",
  "PortalDataManifestFailure": "Không thể thao tác với tệp kê khai cho bảng {0}, đang bỏ qua bản ghi",
  "PortalDataManifestLoad": "Đang tải tệp kê khai cổng thông tin...",
  "PortalDataManifestLoadComplete": "Đã tải tệp kê khai thành công.",
  "PortalDataManifestUpdate": "Đang cập nhật tệp kê khai...",
  "PortalDataManifestUpdateComplete": "Đã cập nhật tệp kê khai thành công.",
  "PortalDataParsingComplete": "Đã hoàn tất phân tích cú pháp dữ liệu bảng cổng thông tin",
  "PortalDeploymentConfigError": "Không áp dụng được cấu hình triển khai cho bảng: {0}, cột: {1} ",
  "PortalDeploymentConfigParseError": "Không phân tích được cú pháp cấu hình triển khai cổng thông tin, vui lòng xóa cấu hình hoặc hoàn nguyên về cấu hình hợp lệ đã biết gần đây nhất",
  "PortalDeploymentProfileNotFound": "Không tìm thấy tệp hồ sơ triển khai {0}.",
  "PortalDeploymentProfileParseError": "Không phân tích được cú pháp hồ sơ triển khai, vui lòng đảm bảo hồ sơ triển khai ở đúng định dạng.",
  "PortalDirectoryNotFound": "Không tìm thấy thư mục {0}",
  "PortalDirectoryOperationFailed": "Không thể thực hiện thao tác với thư mục: {0}",
  "PortalDirectoryParseFailure": "Không xử lý được các trường cho bảng {0}, đang bỏ qua bản ghi",
  "PortalDownloadExcludeEntitiesHelp": "Danh sách tên logic thực thể được phân tách bằng dấu phẩy để loại trừ thao tác tải xuống",
  "PortalDownloadFailedForAField": "Đang xử lý trường {0} trong bảng {1} có ID bản ghi: {2} KHÔNG THÀNH CÔNG do {3}",
  "PortalDownloadFileAlreadyExist": "Tệp {0} đã tồn tại, hãy cung cấp đối số -o true để ghi đè nội dung",
  "PortalDownloadIncludeEntitiesHelp": "Chỉ tải xuống các đối tượng được chỉ định cho đối số này trong tên logic thực thể được phân tách bằng dấu phẩy",
  "PortalDownloadIncludeExcludeOverlap": "Cả hai đối số (--includeEntities và --excludeEntities) đều không được hỗ trợ trong một yêu cầu tải xuống đơn lẻ",
  "PortalDownloadInvalidJsonEditorType": "Loại:{0} không còn hợp lệ để tải xuống",
  "PortalDownloadLocaleFormat": "Định dạng tệp thiết đặt bản địa [Json hoặc Yaml]",
  "PortalEntityDownloadStart": "Đang tải xuống: {0} [{1}]...",
  "PortalEntityNotFound": "Không có sẵn các thực thể cổng thông tin trên tổ chức này, vui lòng cài đặt gói cổng thông tin trên tổ chức.",
  "PortalEntitySchemaError": "Không tìm thấy định nghĩa thực thể cho {0} trong tệp sơ đồ",
  "PortalEntityUploadComplete": "Đã hoàn tất tải lên cho bảng: {0}",
  "PortalEntityUploadNoChanges": "0 thực thể nào được tải lên. Không phát hiện thấy thay đổi nào kể từ lần tải dữ liệu cổng thông tin xuống gần đây nhất.",
  "PortalEntityUploadTimeout": "Tải thời gian chờ phản hồi cho bảng lên: {0} đang tiếp tục tải lên",
  "PortalFileReadFailure": "Không đọc được tệp {0} do {1}",
  "PortalFileSaveFailure": "Không lưu được tệp {0} do {1}",
  "PortalFolderCreateailure": "Không tạo được thư mục {0} do {1}",
  "PortalHelp": "Các lệnh để làm việc với dịch vụ trực tuyến PowerApps Studio",
  "PortalInvalidJsonAttributeWarning": "CẢNH BÁO: Giá trị json mong đợi cho trường {0} trong bảng {1} ID:{2}",
  "PortalInvalidUploadPath": "Đường dẫn tải lên được cung cấp không chứa dữ liệu cổng thông tin, vui lòng cung cấp đường dẫn của thư mục chứa website.yml",
  "PortalListCompleted": "Trang web cổng thông tin danh sách đã hoàn thành",
  "PortalLocaleExtractFailure": "Không trích xuất được văn bản đã bản địa hóa cho ngôn ngữ {0} và khóa {1}",
  "PortalLocaleFolderNotAvailable": "Thư mục {0} không tồn tại trong {1}",
  "PortalManifestKeyError": "Không thể phân tích cú pháp tệp kê khai cổng phân tích cú pháp, thiếu khóa {0} từ đối tượng {1}",
  "PortalManifestParseError": "Không phân tích được cú pháp tệp kê khai cổng thông tin, vui lòng xóa tệp kê khai hoặc hoàn nguyên về cấu hình hợp lệ đã biết gần đây nhất",
  "PortalNoRecordsForEntity": "Không tồn tại bản ghi nào trong bảng {0}",
  "PortalPublisherResult": "Danh sách các nhà phát hành cho {0}",
  "PortalPubsVerb": "Các lệnh để liệt kê các nhà phát hành cho người dùng hiện tại",
  "PortalSkipExportOnlyEntity": "Bỏ qua bảng chỉ xuất: {0}",
  "PortalUploadInvalidJsonEditorType": "Loại:{0} không còn hợp lệ để tải lên",
  "PortalUploadMultipleEntityDataFilesDetected": "Đã phát hiện thấy nhiều tệp dữ liệu bảng",
  "PortalUploadRecordFailure": "Đang cập nhật bảng {0} với ID bản ghi: {1} KHÔNG THÀNH CÔNG do {2}",
  "PortalWebsiteBundleExcludePKHelp": "Nếu cờ này có giá trị đúng, các trường khóa Chính không được đưa vào xml dữ liệu để CMT tạo ID bản ghi mới khi nhập.",
  "PortalWebsiteBundleOutputHelp": "Đường dẫn đến vị trí lưu tệp XML",
  "PortalWebsiteBundlePathHelp": "Đường dẫn đến vị trí sẽ gói nội dung trang web",
  "PortalWebsiteBundleSplitXmlHelp": "Nếu cờ này có giá trị đúng, một xml riêng biệt sẽ được tạo cho mỗi thực thể",
  "PortalWebsiteContentOverwrite": "Nội dung trang web cổng thông tin để ghi đè",
  "PortalWebsiteDownloadPathHelp": "Đường dẫn đến vị trí nội dung trang web sẽ được tải xuống",
  "PortalWebsiteDownloadProcessStart": "Đã bắt đầu tải trang web {0} xuống",
  "PortalWebsiteExportTranslations": "Xuất nội dung bản dịch trong thư mục bản địa: Giá trị “All” sẽ trích xuất tất cả nội dung cho khách hàng C1 & C2. Giá trị “SupportedLang” sẽ trích xuất nội dung có thể bản địa hóa cho khách hàng C2",
  "PortalWebsiteIdToDownload": "ID trang web cổng thông tin sẽ tải xuống",
  "PortalWebsiteMergeLocaleHelp": "Hợp nhất nội dung được bản địa hóa trở lại các tệp yaml cổng thông tin",
  "PortalWebsiteNotAvailable": "Bản ghi trang web {0} không tồn tại.",
  "PortalWebsitePathHelp": "Đường dẫn chứa các tệp trang web",
  "PortalWebsiteUploadDeploymentProfileHelp": "Tên hồ sơ triển khai sẽ được sử dụng. Mặc định được đặt là 'mặc định'",
  "PortalWebsiteUploadPathHelp": "Đường dẫn từ vị trí sẽ tải nội dung trang web lên",
  "PortalWebsiteUploadProcessStart": "Đã bắt đầu tải dữ liệu trang web lên",
  "PortalWebsitesNotExists": "Không tồn tại hồ sơ trang web nào",
  "PortalXRMNetworkError": "Lỗi Mạng XRM: {0}",
  "ProjectReferenceAlreadyExists_RelPath": "Dự án đã có tham chiếu đến \"{0}\".",
  "ProjectRootSearchNoAccess": "Không thể tìm kiếm gốc dự án từ: {0}, quyền truy cập bị từ chối đối với: {1}",
  "ReactControlsDoesNotSupportTheming": "Hiện tại, Đối tượng điều khiển React không hỗ trợ năng lực thiết đặt chủ đề PCF. Đang tạo một đối tượng điều khiển React không được thiết đặt chủ đề.",
  "ReferenceNoProjectsFound": "Không tìm thấy loại dự án được hỗ trợ trong đường dẫn {0}.",
  "ReferenceTooManyProjectsFound": "Đã tìm thấy nhiều loại dự án được hỗ trợ trong đường dẫn {0}.",
  "RequiredProjectFileMissing_ExpectedPath": "Không tìm thấy tệp dự án được yêu cầu “{0}”.",
  "RestoreEnvironmentHelp": "Khôi phục một môi trường vào bản sao lưu đã được cung cấp.",
  "RestoreEnvironmentStart": "Đang khôi phục môi trường từ nguồn \"{0}\" đến đích \"{1}\". Quá trình này sẽ có thời gian chờ để hoàn thành tối đa là 60 phút, trước khi thao tác thất bại",
  "RestoreSelectBackupHelp": "DateTime của bản sao lưu ở định dạng \"mm/dd/yyyy hh:mm\" HOẶC chuỗi \"mới nhất\".",
  "RestoreSourceIdHelp": "Phải có ID môi trường của môi trường nguồn thì mới khôi phục được.",
  "RestoreSourceUrlHelp": "Cần có URL môi trường của môi trường nguồn để khôi phục.",
  "RestoreTargetIdHelp": "ID môi trường của môi trường đích cần thiết cho việc khôi phục. Giá trị này sẽ mặc định là ID nguồn nếu không được cung cấp.",
  "RestoreTargetNameHelp": "Tên tùy chọn của môi trường đã khôi phục.",
  "RestoreTargetUrlHelp": "URL môi trường của môi trường đích cần thiết cho việc khôi phục. Giá trị này sẽ mặc định là URL nguồn nếu không được cung cấp.",
  "RestoredEnvironment": "Đã khôi phục xong môi trường với mã trạng thái : {0}",
  "SelectBackupDateIsInvalid": "Ngày nhập không đúng định dạng. Vui lòng dùng định dạng \"mm/dd/yyyy hh:mm\".",
  "SolutionAddReferenceFailure": "Không thể thêm thông tin tham chiếu đến dự án có cùng tên với dự án Dataverse có tên: {0}.",
  "SolutionAddReferenceHelp": "Thêm một tham chiếu từ dự án trong thư mục hiện tại vào dự án tại 'path'",
  "SolutionAddReferencePathHelp": "Đường dẫn đến dự án được tham chiếu",
  "SolutionAddReferenceSuccess": "Đã thêm thành công thông tin tham chiếu dự án vào dự án giải pháp Dataverse.",
  "SolutionBuildRevisionVersionHelp": "Cập nhật phiên bản build hoặc revision cho giải pháp",
  "SolutionBuildVersionHelp": "Phiên bản build cho giải pháp",
  "SolutionCheckCustomPAEndpointHelp": "Chỉ định một URL tùy chỉnh là điểm cuối Trình kiểm tra Power Apps",
  "SolutionCheckFilesExcludeHelp": "Loại trừ tệp khỏi phân tích. Chuyển dưới dạng các giá trị được phân tách bằng dấu phẩy",
  "SolutionCheckGeoHelp": "Phiên bản theo khu vực địa lý của dịch vụ Trình kiểm tra PowerApps sẽ sử dụng.",
  "SolutionCheckHelp": "Tải một dự án Giải pháp Dataverse lên để chạy với Dịch vụ Trình kiểm tra PowerApps",
  "SolutionCheckPathHelp": "Đường dẫn có chứa tệp zip giải pháp",
  "SolutionCheckRuleOverrideFileNotFound": "Không tìm thấy tệp Thay thế quy tắc.",
  "SolutionCheckRuleOverrideFormatInvalid": "Nội dung của tệp Thay thế quy tắc không được định dạng đúng cách. Các giá trị được chấp nhận cho OverrideLevel gồm có: Critical, High, Medium, Low, Informational. Ví dụ: [{\"Id\":\"meta-remove-dup-reg\",\"OverrideLevel\":\"Medium\"},{\"Id\":\"il-avoid-specialized-update-ops\",\"OverrideLevel\":\"Medium\"}]",
  "SolutionCheckRuleOverrideHelp": "Đường dẫn đến tệp chứa các cấp độ và quy tắc mảng JSON cần thay thế. Các giá trị được chấp nhận cho OverrideLevel gồm có: Critical, High, Medium, Low, Informational. Ví dụ: [{\"Id\":\"meta-remove-dup-reg\",\"OverrideLevel\":\"Medium\"},{\"Id\":\"il-avoid-specialized-update-ops\",\"OverrideLevel\":\"Medium\"}]",
  "SolutionCheckRuleSetError": "Tham số đã chỉ định một tên bộ quy tắc không xác định: \"{0}\" (lấy bộ quy tắc từ: {1})",
  "SolutionCheckRuleSetHelp": "Chọn một bộ quy tắc sẽ được thực thi như một phần của bản dựng này. Giá trị Guid hợp lệ, “AppSource Certification”, “Solution Checker” (mặc định)",
  "SolutionCheckUrlHelp": "URI SAS trỏ tới solution.zip để được phân tích",
  "SolutionCloneErrorFolderExists": "Thư mục giải pháp đã tồn tại và không trống.",
  "SolutionCloneExtractSucceeded": "Đã xuất thành công giải pháp.",
  "SolutionCloneHelp": "Tạo dự án giải pháp dựa trên giải pháp hiện có trong Tổ chức của bạn",
  "SolutionCloneManagedExportSucceeded": "Đã xuất thành công giải pháp được quản lý.",
  "SolutionCloneUnmanagedExportSucceeded": "Đã xuất thành công giải pháp không được quản lý.",
  "SolutionCreateSettingsHelp": "Tạo tệp cài đặt từ tệp zip giải pháp hoặc thư mục giải pháp.",
  "SolutionDeleteHelp": "Xóa Giải pháp Dataverse khỏi Môi trường Dataverse hiện tại",
  "SolutionDeleteProcessEnd": "Đã xóa thành công giải pháp.",
  "SolutionDeleteProcessStart": "Đang xóa giải pháp Dataverse...",
  "SolutionExportAsyncHelp": "Xuất giải pháp không đồng thời",
  "SolutionExportAsyncProcessEnd": "Đã hoàn thành công việc không đồng thời. id lần xuất: {0}",
  "SolutionExportAsyncProcessStart": "Đang chờ công việc không đồng thời hoàn tất... ID lần xuất: {0}",
  "SolutionExportErrorFileExists": "Tệp đầu ra giải pháp {0} đã tồn tại.",
  "SolutionExportErrorInvalidPath": "Đường dẫn tệp {0} không hợp lệ. {1}",
  "SolutionExportHelp": "Xuất Giải pháp Dataverse từ Môi trường Dataverse hiện tại",
  "SolutionExportIncludeHelp": "Những cài đặt nào sẽ được đưa vào giải pháp đang được xuất",
  "SolutionExportManagedHelp": "Có nên xuất giải pháp dưới dạng một giải pháp được quản lý",
  "SolutionExportNameHelp": "Tên của giải pháp được xuất",
  "SolutionExportPathHelp": "Đường dẫn sẽ ghi tệp zip giải pháp đã xuất",
  "SolutionExportProcessStart": "Đang bắt đầu xuất giải pháp...",
  "SolutionExportSucceeded": "Đã xuất thành công giải pháp.",
  "SolutionExportTargetVersionHelp": "Phiên bản mà giải pháp được xuất sẽ hỗ trợ",
  "SolutionHelp": "Những lệnh để làm việc với các dự án giải pháp Dataverse",
  "SolutionImportActivatePluginsHelp": "Kích hoạt phần bổ trợ và quy trình làm việc trong giải pháp",
  "SolutionImportAsHoldingHelp": "Nhập giải pháp dưới dạng giải pháp giữ",
  "SolutionImportAsyncHelp": "Nhập giải pháp không đồng thời",
  "SolutionImportAsyncProcessEnd": "Đã hoàn thành công việc không đồng thời.",
  "SolutionImportAsyncProcessStart": "Đang chờ công việc Không đồng thời hoàn tất... ID công việc: {0}",
  "SolutionImportConvertToManagedHelp": "Chuyển đổi dưới dạng Giải pháp được quản lý",
  "SolutionImportFailed": "Không nhập được giải pháp.",
  "SolutionImportHelp": "Nhập Giải pháp Dataverse vào Môi trường Dataverse hiện tại",
  "SolutionImportImplicitProjectNotFound": "Bạn cần cung cấp đường dẫn tới tệp zip giải pháp dưới dạng đối số {0} hoặc chạy lệnh {1} từ bên trong danh mục dự án giải pháp Dataverse của bạn.",
  "SolutionImportOverwriteUnmanagedHelp": "Buộc ghi đè các tùy chỉnh không được quản lý",
  "SolutionImportPathHelp": "Đường dẫn đến tệp zip giải pháp. Nếu không được chỉ định, giả sử thư mục hiện tại là một dự án cdsproj.",
  "SolutionImportProcessEnd": "Đã nhập giải pháp thành công. ID lần nhập: {0}",
  "SolutionImportProcessStart": "Đang nhập giải pháp...",
  "SolutionImportPublishHelp": "Phát hành các thay đổi của bạn khi nhập thành công",
  "SolutionImportSettingsHelp": "Tệp .json chứa các tùy chọn thiết đặt triển khai cho thông tin tham chiếu kết nối và các biến môi trường.",
  "SolutionImportSkipDependencyHelp": "Bỏ qua kiểm tra phần phụ thuộc đối với các phần phụ thuộc được gắn cờ là cập nhật sản phẩm",
  "SolutionInitAssetSuccessLine1": "Đã tạo thành công các tệp giải pháp Dataverse cho dự án này trong thư mục con {0}, sử dụng tên giải pháp {1}, tên nhà phát hành {2} và tiền tố tùy chỉnh {3}.",
  "SolutionInitAssetSuccessLine2": "Vui lòng xác minh thông tin nhà xuất bản và tên giải pháp được tìm thấy trong tệp {0}.",
  "SolutionInitCustomizationPrefixHelp": "Giá trị tiền tố tùy chỉnh cho đối tác phát triển giải pháp Dataverse",
  "SolutionInitCustomizationPrefixRegexHelp": "Tiền tố phải dài từ 2 đến 8 ký tự, chỉ có thể bao gồm các chữ số alpha, phải bắt đầu bằng một chữ cái và không được bắt đầu bằng 'mscrm'.",
  "SolutionInitExistingProject": "Các tệp giải pháp Dataverse đã tồn tại trong thư mục hiện tại. Bỏ qua việc tạo tệp giải pháp Dataverse.",
  "SolutionInitHelp": "Khởi tạo một thư mục với dự án giải pháp Dataverse mới",
  "SolutionInitPublisherNameHelp": "Tên đối tác phát triển giải pháp Dataverse",
  "SolutionInitPublisherNameRegexHelp": "Chỉ cho phép các ký tự trong phạm vi [A - Z], [a - z], [0 - 9] hoặc _ . Ký tự đầu tiên chỉ được nằm trong phạm vi [A - Z], [a - z] hoặc _.",
  "SolutionInitSuccess": "Đã tạo thành công dự án giải pháp Dataverse có tên “{0}” trong: “{1}”",
  "SolutionInitTooManyOtherDirectories": "Đã tìm thấy một thư mục giải pháp Dataverse bổ sung: {0}. Vui lòng chỉ giữ lại một thư mục.",
  "SolutionInitTooManySolutionXmlFiles": "Đã tìm thấy nhiều tệp {0} trong {1}.",
  "SolutionLicenseAddHelp": "Thêm thông tin gói và giấy phép vào giải pháp",
  "SolutionLicenseFileNotFound": "Không tìm thấy tệp giấy phép “{0}”",
  "SolutionLicenseMismatchedCsvFile": "Tệp .csv của gói dịch vụ “{0}” có số lượng cột không mong muốn, hãy xem trợ giúp về “pac solution add-license”; đã tìm thấy dòng tiêu đề CSV này: “{1}”",
  "SolutionLicenseMismatchedSoPa": "pac CLI và SolutionPackager được bao gồm không khớp nhau. Vui lòng liên hệ với bộ phận hỗ trợ.",
  "SolutionLicensePlanApplied": "Đã áp dụng gói giấy phép cho 2 tệp nguồn trong: {0}",
  "SolutionLicensePlanDefinitionFileHelp": "Tệp định nghĩa gói giấy phép ở định dạng CSV; các cột mong đợi: ID dịch vụ, Tên hiển thị, URL thông tin thêm",
  "SolutionLicensePlanMappingFileHelp": "Tệp ánh xạ gói giấy phép ở định dạng CSV; các cột mong đợi: ID dịch vụ, Tên thành phần",
  "SolutionListHelp": "Liệt kê tất cả các Giải pháp từ Tổ chức Dataverse hiện tại",
  "SolutionListNotFound": "Giải pháp: không tìm thấy “{0}” trong tổ chức Dataverse đích",
  "SolutionListingAll": "Đang liệt kê tất cả các Giải pháp từ Tổ chức Dataverse hiện tại...",
  "SolutionNameHelp": "Tên giải pháp",
  "SolutionNoNameFound": "Không tìm thấy tên giải pháp trong tệp '{0}'",
  "SolutionPackHelp": "Đóng gói các thành phần giải pháp trên hệ thống tệp cục bộ vào solution.zip (SolutionPackager)",
  "SolutionPackUnpackAllowDeletes": "Cho biết liệu thao tác xóa có thể xảy ra hay không [Yes|No]; mặc định là: No.",
  "SolutionPackUnpackAllowWrites": "Cho biết liệu thao tác ghi có thể xảy ra hay không; mặc định là: false.",
  "SolutionPackUnpackArgumentError": "{0}",
  "SolutionPackUnpackClobber": "Cho phép xóa hoặc ghi đè các tệp được đánh dấu là chỉ đọc; mặc định là: false.",
  "SolutionPackUnpackDisablePluginRemap": "Đã vô hiệu hóa ánh xạ tên loại đủ điều kiện hoàn toàn của phần bổ trợ. Mặc định là: false",
  "SolutionPackUnpackErrorLevel": "Mức ghi nhật ký tối thiểu cho đầu ra nhật ký [Verbose|Info|Warning|Error|Off]; mặc định là: Info",
  "SolutionPackUnpackFolder": "Đường dẫn đến thư mục gốc trên hệ thống tệp cục bộ. Khi mở gói/trích xuất thì đây sẽ là đường dẫn để ghi tệp vào đó, còn khi đóng gói thì đây sẽ là đường dẫn để đọc tệp từ đó.",
  "SolutionPackUnpackHelp": "Trích xuất các thành phần giải pháp từ solution.zip lên hệ thống tệp cục bộ (SolutionPackager)",
  "SolutionPackUnpackLocaleTemplate": "Tạo tệp nguồn lực mẫu. Chỉ có hiệu lực khi Trích xuất. Giá trị được phép là giá trị tự động hoặc mã LCID/ISO của ngôn ngữ mà bạn muốn xuất. Khi Trình bày, thao tác này sẽ trích xuất các nguồn lực chuỗi từ vùng bản địa đã cho dưới dạng .resx trung lập. Nếu giá trị tự động hoặc chỉ dạng dài hoặc dạng ngắn của khóa chuyển được chỉ định, vùng bản địa cơ sở cho giải pháp sẽ được sử dụng.",
  "SolutionPackUnpackLocalize": "Trích xuất hoặc hợp nhất tất cả nguồn lực chuỗi vào tệp .resx.",
  "SolutionPackUnpackLogFile": "Đường dẫn đến tệp nhật ký.",
  "SolutionPackUnpackMappingFile": "Đường dẫn đầy đủ đến tệp xml ánh xạ để đọc các thư mục thành phần từ đó rồi đóng gói.",
  "SolutionPackUnpackPackageType": "Khi mở gói/trích xuất, dùng để chỉ định thao tác Managed và Unmanaged kép. Khi đóng gói, dùng để chỉ định Managed hoặc Unmanaged từ thao tác mở gói “Both” trước đó. Có thể là: “Unmanaged”, “Managed“ hoặc “Both”; mặc định là: “Unmanaged”",
  "SolutionPackUnpackSingleComponent": "Chỉ thực hiện hành động trên một loại thành phần đơn lẻ [WebResource|Plugin|Workflow|None]; mặc định là: None.",
  "SolutionPackUnpackUseLcid": "Sử dụng mã LCID (1033) thay vì mã ISO (en-US) cho các tệp ngôn ngữ.",
  "SolutionPackUnpackUseUnmanagedFileForManaged": "Sử dụng cùng tệp nguồn XML khi tìm thấy thao tác đóng gói cho tệp XML Managed và chỉ Unmanaged; áp dụng cho các tệp AppModuleSiteMap, AppModuleMap, FormXml",
  "SolutionPackUnpackZipFile": "Đường dẫn đầy đủ đến tệp ZIP giải pháp",
  "SolutionPatchVersionHelp": "Phiên bản Patch cho giải pháp",
  "SolutionProjectNotFound": "Không tìm thấy tệp dự án giải pháp Dataverse có phần mở rộng cdsproj trong thư mục.",
  "SolutionProjectOutputZipNotFound": "Không tìm thấy tệp *.zip cho dự án giải pháp Dataverse. Bạn đã quên không tạo?\\nĐường dẫn dự án: {0}",
  "SolutionProjectRootNotFound": "Không tìm thấy gốc dự án giải pháp (đang tìm tệp .cdsproj hoặc “Other/solution.xml” để suy luận); vui lòng chỉ định gốc dự án.",
  "SolutionPublishHelp": "Phát hành tất cả các tùy chỉnh",
  "SolutionPublishedAllCustomizations": "Đã phát hành tất cả các tùy chỉnh.",
  "SolutionPublishingAllCustomizations": "Đang phát hành tất cả các tùy chỉnh...",
  "SolutionRevisionVersionHelp": "Phiên bản revision cho giải pháp",
  "SolutionSetOnlineVersionHelp": "Đặt phiên bản cho giải pháp được tải trong môi trường Dataverse.",
  "SolutionUpgradeAsyncHelp": "Nâng cấp giải pháp không đồng thời",
  "SolutionUpgradeAsyncProcessEnd": "Đã hoàn tất công việc nâng cấp giải pháp không đồng thời, ID yêu cầu: ",
  "SolutionUpgradeAsyncProcessStart": "Đang chờ công việc nâng cấp giải pháp Không đồng thời hoàn tất... ID yêu cầu: ",
  "SolutionUpgradeHelp": "Tùy chọn để tách chuyển giải pháp Dataverse cho bản nâng cấp",
  "SolutionUpgradeProcessEnd": "Đã nâng cấp giải pháp thành công. ID yêu cầu: ",
  "SolutionUpgradeProcessStart": "Đang nâng cấp giải pháp...",
  "SolutionVersionHelp": "Chỉ định số phiên bản giải pháp.",
  "SolutionVersionInvalidProjFile": "Không tìm thấy tệp cdsproj hoặc tệp “Solution.xml” trong thư mục hiện tại “{0}”.",
  "ToolCMTHelp": "Cho chạy Configuration Migration Tool",
  "ToolHelp": "Power Platform Tools có thể được cài đặt và khởi chạy",
  "ToolInstallHelp": "Cài đặt phiên bản mới nhất.",
  "ToolInstallationComplete": "Hoàn tất việc cài đặt",
  "ToolInstalling": "Đang cài đặt phiên bản {0} của {1}...",
  "ToolPDHelp": "Cho chạy Package Deployer",
  "ToolPRTHelp": "Cho chạy Plugin Registration Tool",
  "UnhandledExceptionLogFileLocation_Path": "Bạn có thể tìm thấy nhật ký chẩn đoán tại: {0}",
  "UnhandledExceptionMessage": "Rất tiếc, ứng dụng gặp lỗi không thể khôi phục và cần phải đóng lại. Các chi tiết ngoại lệ đã được ghi lại và sẽ được chuyển tiếp đến nhóm phát triển, nếu phương pháp đo từ xa đã được kích hoạt. ID ngoại lệ:",
  "UnhandledExceptionMessage_ExId_ExType": "Rất tiếc, ứng dụng gặp lỗi không thể khôi phục và cần phải đóng lại. Các chi tiết ngoại lệ đã được ghi lại và sẽ được chuyển tiếp đến nhóm phát triển, nếu phương pháp đo từ xa đã được kích hoạt. ID ngoại lệ: {0}, Loại ngoại lệ: {1}",
  "UnknownArgument": "Đối số {0} đã chuyển không xác định.",
  "UnknownArgumentValue": "Giá trị đối số cho {0} đã chuyển không xác định.",
  "UnknownCommand": "Lệnh '{0}' đã gửi không xác định.",
  "UnneededArgument": "Đối số đã chuyển không cần thiết.",
  "UnpackProcessEnd": "Đã mở gói giải pháp.",
  "UnpackProcessStart": "Đang mở gói giải pháp...",
  "UpdatedBuildVersionFilePath": "Đã cập nhật phiên bản build cho {0}.",
  "UpdatedPatchVersionFilePath": "Đã cập nhật phiên Patch cho {0}.",
  "UpdatedRevisionVersionFilePath": "Đã cập nhật phiên bản revision cho {0}.",
  "UsageWithColon": "Sử dụng: {0}",
  "ValuesWithColon": "Giá trị: ",
  "VerbArgumentExceptionErrorMessage_ArgName_Reason": "Đối số “{0}” không hợp lệ. {1}",
  "VerbArgumentFramework": "Khung kết xuất để kiểm soát.",
  "VerbArgumentLogToConsole": "Xuất nhật ký ra bảng điều khiển",
  "VerbArgumentLogToFile": "Đường dẫn tệp nhật ký",
  "VerbArgumentOutputDirectory": "Thư mục đầu ra",
  "VerbArgumentRunNpmInstall": "Tự động chạy “npm install” sau khi tạo đối tượng điều khiển. Giá trị mặc định là “true”",
  "VersionAlreadyInstalled": "Đã cài đặt phiên bản mới nhất.",
  "VersionIsInvalid": "Không thể xác định phiên bản cho “{0}”.",
  "VersionNotInstalled": "Cần chạy 'pac tool {0} --install' để tải exe mới nhất.",
  "VersionWithColon": "Phiên bản: {0}",
  "WarningWithColon": "Cảnh báo: ",
  "Yes": "Có"
}